
{
    
    
    
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
        
        
        
    
    "pages": [{"date":"2024-08-17","image":"","imageAlt":"","link":"//localhost:1313/home/","summary":"Hello World! You can call me Alvin McGee, and this is my small corner of the internet.\nAt the moment, this site solely houses pieces of comedy that I\u0026rsquo;ve written over the years, but at some point I may post essays or fiction.","tags":[],"text":"hello world! you can call me alvin mcgee, and this is my small corner of the internet.\nat the moment, this site solely houses pieces of comedy that i\u0026rsquo;ve written over the years, but at some point i may post essays or fiction.\n","title":"Home"},{"date":"2024-05-15","image":"","imageAlt":"","link":"//localhost:1313/humor/glass/glass/","summary":"(all of this is very silly and none of it ought to be taken seriously)\nWhether the glass is half empty or half full is and has always been a matter of much debate. In a question to answer this age - old question, we first asked the world\u0026rsquo;s philosohpers, then mebers of major religious groups, and (at last, for good measure, we asked several major political figures). This is what they said:","tags":["Half Empty or Half Full?","Humor"],"text":"(all of this is very silly and none of it ought to be taken seriously)\nwhether the glass is half empty or half full is and has always been a matter of much debate. in a question to answer this age - old question, we first asked the world\u0026rsquo;s philosohpers, then mebers of major religious groups, and (at last, for good measure, we asked several major political figures). this is what they said:\npart i: philosophers\npart ii: religions\npart iii: politicans\n","title":"Half Empty or Half Full?"},{"date":"2024-05-15","image":"","imageAlt":"","link":"//localhost:1313/humor/aaa/7/","summary":"Anabel Lee is one of those people who advertises marketing courses on social media. After making a grand total of twenty five 25 dollars in the business last year, Lee decided to branch out into crypto trading, essential oils, and giving advice to people happier than she is. Based on that one semester she spent in community college, Lee has christened herself an expert on all things college, and has started selling courses on that too.","tags":["Assorted Awful Advice","Humor"],"text":"anabel lee is one of those people who advertises marketing courses on social media. after making a grand total of twenty five 25 dollars in the business last year, lee decided to branch out into crypto trading, essential oils, and giving advice to people happier than she is. based on that one semester she spent in community college, lee has christened herself an expert on all things college, and has started selling courses on that too.\n1.) refuse to take standardized tests. standardized tests are a scam forced upon us by the college board to make more money. by taking them, you are dignifying this evil capitalist system. it\u0026rsquo;s not like they\u0026rsquo;re that important anyway, colleges don\u0026rsquo;t really care that much about your academic performance in the first place.\n2.) do everything you can to get into a top school. if you don\u0026rsquo;t get into yale or cornell, your life will be over, you might as well become a plumber or something. no one in the history of the world has had a happy or fulfilling life without being to yale or cornell \u0026ndash; how can life be worth living without snobby rich friends?!\n3.) choose your admissions essay as the time for a principled stand against social - desirability bias. people write their admissions essay in a complicated language of lies and half truths. this makes you seem slimy and it violates your principles! so, don\u0026rsquo;t do it! instead of saying \u0026ldquo;i joined the underwater marble stacking club out of my great passion or the subject\u0026rdquo; say \u0026ldquo;i need to convince you i\u0026rsquo;m a well - rounded person. instead of saying \u0026ldquo;i spent a gap year traveling because i wanted to see the world,\u0026rdquo; say \u0026ldquo;i wanted to have sex with europeans.\u0026rdquo; you get the picture!\n4.) mention your east asian heritage. everyone knows asians tend to be hard - workers who excel academically, so colleges are really happy to have them! right?\n5.) put your mom down as your only character reference. parents are the most objective sources of information about their children, and colleges all know this. besides, your mom is well known among college recruiters and most have positive memories of her.\n6.) humorously respond to texts from colleges. the random texts you get from colleges are all sent by bots, and an actual human being will never read your response. so, why not have a little fun and write something humorous, like \u0026ldquo;did you really think i want to live in a third world country like alabama?\u0026rdquo; or \u0026ldquo;shut the hell up chloe ion wanna attend yo bum ass school.\u0026rdquo;\n7.) make your admissions essay as wordy as possible. this is because smart people always use a bunch of big words, and you wanna look smart, don\u0026rsquo;t you?\n","title":"Assorted Awful Advice Part Seven: Applying for College"},{"date":"2024-03-14","image":"","imageAlt":"","link":"//localhost:1313/humor/yh/yh/","summary":"\u0026ldquo;But your honor, I only purchased those five hundred pounds of fertilizer because it tastes so damn good!\u0026rdquo;\n\u0026ldquo;Your honor, I know I\u0026rsquo;m on the no - fly list, but I was clearly wearing basketball shorts.\u0026rdquo;\n\u0026ldquo;Your honor, I sincerely apologize. I merely forgot that armed robbery is illegal.\u0026rdquo;\n\u0026ldquo;Your honor, I know the light was red, but I only turned the right way.\u0026rdquo;\n\u0026ldquo;Your honor, have a little respect! I spent the better part of two months working on that thing.","tags":["Humor"],"text":"\u0026ldquo;but your honor, i only purchased those five hundred pounds of fertilizer because it tastes so damn good!\u0026rdquo;\n\u0026ldquo;your honor, i know i\u0026rsquo;m on the no - fly list, but i was clearly wearing basketball shorts.\u0026rdquo;\n\u0026ldquo;your honor, i sincerely apologize. i merely forgot that armed robbery is illegal.\u0026rdquo;\n\u0026ldquo;your honor, i know the light was red, but i only turned the right way.\u0026rdquo;\n\u0026ldquo;your honor, have a little respect! i spent the better part of two months working on that thing. calling it an \u0026lsquo;improvized\u0026rsquo; explosive is just insulting.\u0026rdquo;\n\u0026ldquo;no, your honor, i didn\u0026rsquo;t really mind that she got the kids. what pushed me over the edge is how she took the air fryer.\u0026rdquo;\n\u0026ldquo;your honor, i assure you that he put those cement shoes on his own feet, shot himself in the back of the head, and lept into the lake of his own accord.\u0026rdquo;\n\u0026ldquo;your honor, i was innocent by reason of insanity. you would be too if you had to live with him.\u0026rdquo;\n\u0026ldquo;your honor, i assure you i was only driving one way.\u0026rdquo;\n\u0026ldquo;your honor, i\u0026rsquo;m not a paranoid schizophrenic. the voices made that much clear!\u0026rdquo;\n\u0026ldquo;oh no, your honor, the person on that id card is clearly me. i was just heavier then. and had a beard. and was five years older.\u0026rdquo;\n\u0026ldquo;your honor, you don\u0026rsquo;t understand. i did all the drinking before i started driving.\u0026rdquo;\n\u0026ldquo;no, your honor, i\u0026rsquo;m not a lone shark. it\u0026rsquo;s merely coincidence that all of my customers end up breaking their knee caps.\u0026rdquo;\n\u0026ldquo;your honor, i know i stole that car, but you have to understand there were extenuating circumstances. without it i would have been fifteen minutes late to that taylor swift concert!\u0026rdquo;\n\u0026ldquo;with all due respect, your honor, what do you mean i was \u0026lsquo;disturbing the peace?\u0026rsquo; my music was only 108 decibels that night.\u0026rdquo;\n\u0026ldquo;your honor, it wasn\u0026rsquo;t underage drinking. that child is 21 months old!\u0026rdquo;\n","title":"Your Honor"},{"date":"2024-01-08","image":"","imageAlt":"","link":"//localhost:1313/humor/aaa1/","summary":"This page is written by Wilhelm Spurtendorf, lover of all things painful and frustrating.\nMost of the time people seek out advice, it\u0026rsquo;s because they want to get better at something. Pages upon pages of this sort of stuff can be found all over the internet. It\u0026rsquo;s almost a damn deluge! Of course, this is all well and good for some people, but it\u0026rsquo;s horrible for people like me: mascochists!","tags":["humor"],"text":"this page is written by wilhelm spurtendorf, lover of all things painful and frustrating.\nmost of the time people seek out advice, it\u0026rsquo;s because they want to get better at something. pages upon pages of this sort of stuff can be found all over the internet. it\u0026rsquo;s almost a damn deluge! of course, this is all well and good for some people, but it\u0026rsquo;s horrible for people like me: mascochists!\ni don\u0026rsquo;t mean watered down, trendy masochism - the kind where you just want to pretend your girlfriend is an arab slave trader and have her pretend you\u0026rsquo;re a piñata. no, i mean hardcore, traditional masochism, the kind where you make your mission in life experiencing as much gratuitous suffering as possible. being a member of this demographic, i\u0026rsquo;ve always noticed how we\u0026rsquo;re excluded from this hedonormative society, and especially from places where hedonormative people give advice. they just assume everyone doesn\u0026rsquo;t want to experience suffering and failure!\nto mend this gaping hole in the online landscape, i\u0026rsquo;ve begun curating a series of articles with the goal of helping you live the most unpleasant, painful, and downright miserable life you possibly can, all with the help of some of the world\u0026rsquo;s greatest givers of terrible advice.\n# recent posts: assorted awful advice part seven: applying for college\nassorted awful advice part six: gomer\u0026rsquo;s guide to christian homeschooling\nassorted awful advice part five: pc care\n\u0026hellip;\n[archive]\n","title":"Assorted Awful Advice"},{"date":"2024-01-06","image":"","imageAlt":"","link":"//localhost:1313/humor/humor/","summary":"Assorted Awful Advice - A series of articles I write explaining how to fill one\u0026rsquo;s life with suffering, failure, and frustration. Updated every so often.\nHalf Empty or Half Full? - Whether the glass is half empty or half full is and has always been a matter of much debate. In order to find out the truth, we asked a wide array of people what they thought.\nThe Many Problems of Jack - A mock epic I wrote in high school, told through a series of word problems I was forced to present before my math classes.","tags":["Humor"],"text":"assorted awful advice - a series of articles i write explaining how to fill one\u0026rsquo;s life with suffering, failure, and frustration. updated every so often.\nhalf empty or half full? - whether the glass is half empty or half full is and has always been a matter of much debate. in order to find out the truth, we asked a wide array of people what they thought.\nthe many problems of jack - a mock epic i wrote in high school, told through a series of word problems i was forced to present before my math classes. starring and sometimes written with the help of my friend jack.\nyour honor jokes - a collection lines with which to defend oneself in court. success not guaranteed.\n","title":"Humor"},{"date":"2023-10-06","image":"","imageAlt":"","link":"//localhost:1313/humor/aaa/6/","summary":"Gomer Schmid is the submissive wife of Jebediah Schmid and stay at home mother of 17 children, all of whom they have homeschooled since birth. She previously worked part - time manufacturing essential oils and knee - length denim skirts. But then, her husband was fired, forcing her to stop working out of a fear that being the family\u0026rsquo;s breadwinner would compromise male headship. Thankfully for the Schmids\u0026rsquo; finances, Jebediah was recently able to snag a job as a youth pastor, in which role he lures teenagers into the Kingdom of God with the help of pizza and donuts.","tags":["Assorted Awful Advice","Humor"],"text":"gomer schmid is the submissive wife of jebediah schmid and stay at home mother of 17 children, all of whom they have homeschooled since birth. she previously worked part - time manufacturing essential oils and knee - length denim skirts. but then, her husband was fired, forcing her to stop working out of a fear that being the family\u0026rsquo;s breadwinner would compromise male headship. thankfully for the schmids\u0026rsquo; finances, jebediah was recently able to snag a job as a youth pastor, in which role he lures teenagers into the kingdom of god with the help of pizza and donuts.\nhey, y\u0026rsquo;all! the kabal just keeps runnin\u0026rsquo; public schools into the ground, so a load of you people have been thinkin\u0026rsquo; about homeschooling your full quivers. sadly, satan personally runs several websites which dispense with unhelpful, spiritually dangerous, and downright liberal advice about how to homeschool. to combat this brood of vipers, i have been raised up to set the record straight. if you follow my dictates, along with establishing the requisite hedge of protection around your homestead, satan will not be able to get your little darlins.\n1.) whatever you do, don\u0026rsquo;t send them to a co - op. co - ops are these glorified public school things, things where you sent your children to be taught by someone else and be part of a class a few times a week. for all you know, this person might be a satanist, or even a liberal. i have seen co - ops were people rebel against nature on the daily, places where girls wear pants, dye their hair vile colors, and have the gall to drive themselves to school.\n2.) be watchful about the textbooks you give your quiver. naturally, you will want to avoid any and all of those humanist, public school textbooks. but, many \u0026ldquo;\u0026ldquo;\u0026ldquo;christian\u0026rdquo;\u0026rdquo;\u0026rdquo; textbooks are scarce better. i have seen biology textbooks which use evolutionary assumptions, anatomy textbooks which mention the efficacy of \u0026ldquo;\u0026ldquo;\u0026ldquo;vaccines,\u0026rdquo;\u0026rdquo;\u0026rdquo; art books which contain pornographics, and history books that refuse to call the war of northern aggression by it true, god - given name.\n3.) let your little darlins learn at their own pace. deadlines put a damper on the natural, care - free state of your children. it\u0026rsquo;s far better to let them roam out into the cornfields and learn whatever they want at their own pace. this will do wonders for their academic performance.\n4.) stringently vet your children\u0026rsquo;s playmates. when children reach a certain age, many of them wish to venture out of your homestead and befriend others. though it may not be ideal, this is not an evil in and of itself. however, you must make sure they do not ensnare themselves in the world. i have seen many a children dragged astray by the vile machinations of a demon - possessed, humanist toddler.\n5.) inject my essential oils into your quiver\u0026rsquo;s arms. as is common knowledge, the kabal puts many chemicals into the drinking water designed to turn your children into homophile satanists. the best way to counteract this satanic attack is to inject my essential oil\u0026rsquo;s into your little darlins\u0026rsquo; bodies. it will also decalcify their penial gland, guaranteed.\n","title":"Assorted Awful Advice Part Six: Gomer's Guide to Christian Homeschooling"},{"date":"2023-10-05","image":"","imageAlt":"","link":"//localhost:1313/humor/aaa/5/","summary":"Jeb Smutty is a 14 year old middle school student in Fort Worth, Texas, where he spends his days watching anime, browsing Reddit, and making life hell for his older sister, Kristie. Despite his young age, Smutty has gained quite a reputation for exacerbating technical difficulties and bemoaning his perpetual celibacy all across the internet. When we decided to host an article about computers, we knew he was just the man for the job.","tags":["Assorted Awful Advice","Humor"],"text":"jeb smutty is a 14 year old middle school student in fort worth, texas, where he spends his days watching anime, browsing reddit, and making life hell for his older sister, kristie. despite his young age, smutty has gained quite a reputation for exacerbating technical difficulties and bemoaning his perpetual celibacy all across the internet. when we decided to host an article about computers, we knew he was just the man for the job. with the oxford dictionary of zoomer slang in hand, our resident paleographer was able to translate several more obscure phrases into oldspeak for the benefit of readers over 30.\nhey fellas, i\u0026rsquo;m mister smutty, but you can call me smut for short. everyone does. there are a bunch of people out there who, no cap, don\u0026rsquo;t know how to use computers in 2023, so i\u0026rsquo;m here to help out.\n1.) when your computer gets hot, throw it into the nearest lake. this is called \u0026ldquo;water cooling,\u0026rdquo; and all serious pc users use it.\n2.) don\u0026rsquo;t buy cooling at all. sometimes, cooling just gets expensive. just using the cooler that comes with your cpu might make you a cheap wuss, so i had to buy my own high - falutin\u0026rsquo; one. that got me a hundred dollars in debt to my mean older sister, and my parents, like, expect me to pay her back or something. don\u0026rsquo;t be like me, just don\u0026rsquo;t use no cooling at all. you\u0026rsquo;ll be fine. probably. don\u0026rsquo;t @me.\n3.) install pc optimizer pro. pc optimizer pro is, like, the most based app ever. it detects all of these viruses no other programs are able to and then lets you get rid of them for a fair price.\n4.) give websites access to any and all permissions they request. hell yeah that piracy website needs to know your location! why would they ask for it if they didn\u0026rsquo;t need it?\n5.) add rgb lighting to your pc build. rgb lighting is real drippy, but it\u0026rsquo;s also both quick and easy to add to your build. more importantly, in a similar way to how putting stickers on race cars makes them go vroom faster, rgb lighting can improve the processing speed of a pc by several orders of magnitude.\n6.) plug your monitor into your cpu rather than your graphics card. this will keep your gpu from overheating. i\u0026rsquo;ve been doing this for months and it works fine, i can even get 10 fps in skyrim!\n7.) use templeos. windows, linux, and mac may be good at all, but they aren\u0026rsquo;t based and redpilled. their creation wasn\u0026rsquo;t literally mandated by god. templeos\u0026rsquo;s was. \u0026lsquo;nuff said.\n8.) scrape the pins off the bottom of your cpu. the pins on the bottom of your cpu tickle your motherboard and make it sneeze, which is why my pc started emitting smoke yesterday. best nip that problem in the bud and get rid of those damn pins.\n9.) download more ram. on god, if your computer is slow, you better do this. one cannot simply download too much ram. kristie thinks this is stupid, but that\u0026rsquo;s because she\u0026rsquo;s a moron!\n10.) bash your pc over and over with a large metal clock. this is called \u0026ldquo;overclocking,\u0026rdquo; and it does wonders for performance.\n12.) download things from shady websites. it\u0026rsquo;s a well - known fact that ai - generated websites which look like they were made in the 90s are the best places to find software. that and the ads you get at the top of google search results!\n13.) collect dust specifically to feed into your pc. everyone has to eat, and computers are no exception. for me, this might mean eating pizza and drinking mnt dew, but for computers it means eating dust. to feed your computer dust, sweep some up into a dustpan, take your computer\u0026rsquo;s panel off, and throw it all in.\n","title":"Assorted Awful Advice Part Five: PC Care"},{"date":"2023-08-22","image":"","imageAlt":"","link":"//localhost:1313/humor/aaa/4/","summary":"Sleazy McFly is a well - known self help author and convicted con artist. About 70 people have bought his free book, and more than four of them didn\u0026rsquo;t try to sue him afterwards.\nHey there fellas, I\u0026rsquo;m Sleazy McFly, but you can call me Sleaze for short. I\u0026rsquo;m here to make you rich, and if you follow all of my advice down to the letter, I can confidently tell you that one of us will be richer than he was before!","tags":["Assorted Awful Advice","Humor"],"text":"sleazy mcfly is a well - known self help author and convicted con artist. about 70 people have bought his free book, and more than four of them didn\u0026rsquo;t try to sue him afterwards.\nhey there fellas, i\u0026rsquo;m sleazy mcfly, but you can call me sleaze for short. i\u0026rsquo;m here to make you rich, and if you follow all of my advice down to the letter, i can confidently tell you that one of us will be richer than he was before!\n1.) invest in my cryptocurrency. my cryptocurrency, sleazecoin, is a up and coming player on the cryptocurrency scene, and is already accepted as legal tender in the great nation of whambezia.\n2.) start gambling. see the previous point. you gotta be dedicated about it, though, can\u0026rsquo;t be a sunshine gambler. even if things get bad, you\u0026rsquo;ve got to keep pulling that lever. 99% of gamblers quit right before their next big win.\n3.) give 75% of your income to me. now, you may be thinking, \u0026ldquo;sleaze, why the hell would i do that? that\u0026rsquo;s just what a con artist would tell me to do!\u0026rdquo; well, you only think that because you\u0026rsquo;re an idiot! i ain\u0026rsquo;t no conman, good old sleaze would never con a fly. who are you gonna believe, me or your lying eyes? either way, science backs this piece of advice up: 98% (!) of non - millionaires have not given 75% of their income to me[1]. therefore, paying up is one of the most sure - fire ways you can become one.\n4.) buy expensive things in public. if you publicly spend a load of money, it may not make you a millionaire, but it\u0026rsquo;ll at least make other people think you have disposable income.\n5.) commit tax fraud. this both lets you keep more money and sets you apart from the blue - pilled sheeple.\n6.) take money out of offering plates at churches. churches are collecting that money to give to well - off, wannabe millionaires (that\u0026rsquo;s what jesus was all about, right?). it\u0026rsquo;s no harm to take some out directly.\n7.) sell your soul to the devil. selling your immortal soul to the prince of darkness may sound like a bad idea. but, he\u0026rsquo;s offering a substantial sum of money in exchange for it. and, in the immortal words of tommy johnson, a musician who enjoyed great success after forfeiting his soul at a roadside deal with the devil, \u0026ldquo;it ain\u0026rsquo;t like i was using it or nothing.\u0026rdquo; [2]\n8.) buy my free book. my free book is a magical talisman which will turn dirt into gold. i\u0026rsquo;ll send it to you if you email me your name, your social security number, and your mother\u0026rsquo;s maiden name.\n[1] source: it was revealed to me in a dream.\n[2] source: the 2000 documentary film o brother, where art thou?\n","title":"Assorted Awful Advice Part Four: How to Become a Millionaire"},{"date":"2023-06-30","image":"","imageAlt":"","link":"//localhost:1313/humor/aaa/3/","summary":"Dr. Jim Stanford is a well - known chiropractor and Scientologist, as well as the co - founder of Carl Robinson\u0026rsquo;s Association for Pediatric Studies. He was the only person with a \u0026ldquo;Dr.\u0026rdquo; next to their name who was willing to write something for us vaguely related to medicine, so we\u0026rsquo;re stuck with him.\nI\u0026rsquo;m Dr. Jim Stanford (PhD), and I have some alarming news for you. Almost 100% of people who die in house fires were not following my sleeping advice.","tags":["Assorted Awful Advice","Humor"],"text":"dr. jim stanford is a well - known chiropractor and scientologist, as well as the co - founder of carl robinson\u0026rsquo;s association for pediatric studies. he was the only person with a \u0026ldquo;dr.\u0026rdquo; next to their name who was willing to write something for us vaguely related to medicine, so we\u0026rsquo;re stuck with him.\ni\u0026rsquo;m dr. jim stanford (phd), and i have some alarming news for you. almost 100% of people who die in house fires were not following my sleeping advice. the verdict of science is clear - whether or not you follow this simple five step program could be a matter of life and death. so, read carefully.\n1.) if you see a toilet in a dream, use that fella. toilet use in dreams has a long and prestigious history, dating back to the times of the ancient greeks. they believed that if you used a dream toilet, upcoming lottery numbers would be miraculously revealed to you. i can tell you this works from personal experience.\n2.) never change your sheets. cleaning your sheets is just so \u0026hellip; unnatural. it drives away natural wonders like lice and body odor! how could anyone want that?\n3.) ponder the deep questions of life while you try to sleep. how do we know anything at all? is there a god? does becky want to sleep with you or is she just being nice? these questions and others have fascinated and confounded philosophers for centuries, and there\u0026rsquo;s no better time to think about then than while you\u0026rsquo;re a half - sleeping, melatonin drenched mess.\n4.) cook recipes revealed to you in dreams. the ancestral spirits occasionally reveal recipes to people while deep in sleep. they are always delicious, cheap, and filled with vitamins!\n5.) attempt to sleep in a large american city. large american cities are the most lovely sleeping locales of them all. the musical sounds of noisy machinery, people yelling, and gun violence will lull you to sleep, guaranteed.\n","title":"Assorted Awful Advice Part Three: Sleeping"},{"date":"2023-05-18","image":"","imageAlt":"","link":"//localhost:1313/humor/aaa/2/","summary":"This post is guest – written by Lester Phelps. Phelps is a burgeoning TikTok star and professional social media influencer. Since his rise to stardom last Tuesday, Phelps has helped at least three men just like you get laid, or so he claims on the ‘about’ section of his YouTube page. He lives in his parents’ basement in Boston, where he enjoys drinking Mountain Dew and browsing 4chan with the love of his life, a Sailor Moon bodypillow.","tags":["Assorted Awful Advice","Humor"],"text":"this post is guest – written by lester phelps. phelps is a burgeoning tiktok star and professional social media influencer. since his rise to stardom last tuesday, phelps has helped at least three men just like you get laid, or so he claims on the ‘about’ section of his youtube page. he lives in his parents’ basement in boston, where he enjoys drinking mountain dew and browsing 4chan with the love of his life, a sailor moon bodypillow.\nwhether it’s because of soy or feminism or the fluoride in the drinking water, it seems like men these days just struggle to find the girl they deserve. that’s where ya boi lester comes in. informed by ten years of personal experience browsing various online message boards, i have created this ten point program to help any man attract the girl of his dreams.\n1.) refrain from showering and using deodorant. there’s no greater aphrodisiac for women than the pheromones coming off of an unwashed male body. many people continue to deny this (despite the overwhelming evidence) because the corporate media has been bribed by big shampoo to produce pro-shower propaganda.\n2.) stand outside of her window at 3:00 am while yodeling and flapping your arms like a pidgeon. running around in circles, being naked, and having downed a keg of beer beforehand all help. to put the cherry on the top, occasionally let out a storkish mating call. i have had more success with this method than any other.\n3.) put up attraction signs all over town. an attraction sign is a small poster which informs women what you’re about. it should have some information about yourself and then list everything important you’re looking for in a woman: maximum tolerable bmi, desired bra size, hair color, etc. before his transformation into a lesbian goddess, the noted stud christian weston chandler employed this strategy with great success.\n4.) brag about how big your pockets are to her in order to assert dominance. women, as is well – known, have pockets whose length and width are measured in planck units. sometimes they just need a little reminder of this to put them in their place. somehow, doing this will make them want to have sex with you. we’re still in the dark as to why.\n5.) send her dick pics. if there’s one thing women love, it’s receiving grainy images of your penis, preferably with captions such as “you want a piece of this!?!?!?” or “here”s johnny!1!11” this trait evolved among women during the pliocene. people were less progressive then, so pornography was illegal. if you were caught distributing it, the tribal elders would throw shit at you. taking that risk made you rebellious, bold, and zesty. either that or you just wanted people to throw shit at you, which also makes the girls go wild.\n6.) become a discord moderator. though often unfairly maligned, discord moderators are incredibly effective with the ladies. this is largely because of our unique body type and well – regarded manners.\n7.) remember that she’s hypergamous. students of female nature like andrew tate have known this for a long time. it means that chicks are into guys who are super hyper. so, if you wanna attract a girl, you should chug about a gallon of coffee and about that much pure sugar. you should also make sure to get your covid vaccine, because those give people adhd. don’t get the boosters though, because they cause autism. women don’t like that.\n8.) send her lots of incoherent text messages for no reason. women just love spam, preferably spam that don’t make a lick of sense. they are thought to have evolved this trait during the pliocene, when people accessed the internet via a configuration of stone knives and bear skins known as ‘dial up.’ it was really, god - awfully slow, so if a man was willing to send several books worth of incoherent dms, it meant that he was really dedicated. either that or he just didn’t have anything better to do, which women also love in a man.\n9.) invent a disgusting pet name for her. this behavior is often associated with couples who have been together for some time, and is reported to be especially prevalent among newlyweds. but, you don’t have to save your pet names for marriage! you don’t even have to wait until she knows you name! what could make a woman love you more than being called your fuzzy wuzzy love lobster all day long?\n10.) use pickup lines. pickup lines have a long and storied history of success. they were invented by the wright brothers, who could often be found asking women “hey, baby, you wanna join the ten foot high club?” while this was certainly not as refined as the modern pickup line, it is notable for historical reasons. nowadays, researchers have gotten pickup lines down to an exact science; making the world aware of gems like “are you a toaster? because i want to take a bath with you.” and “i heard you were into antiques, and i’ve got some junk that hasn’t been touched in ages.” many others of similar effectiveness can be found on the internet, and they’ll make you a stub overnight.\n","title":"Assorted Awful Advice Part Two: How to Get a Girlfriend"},{"date":"2023-05-18","image":"","imageAlt":"","link":"//localhost:1313/humor/problems/","summary":"The homeschool co - op I attended in High School had many idiosyncrasies, but one of its most memorable is how we were forced to present math problems before our classmates. Sometimes these were taken out of textbooks or off of the internet, but more often we invented them ourselves (frequently on the drive over to school or during lunch). Mostly, their narratives were really boring! As if the were learning math or something.","tags":["Humor","Math Problems"],"text":"the homeschool co - op i attended in high school had many idiosyncrasies, but one of its most memorable is how we were forced to present math problems before our classmates. sometimes these were taken out of textbooks or off of the internet, but more often we invented them ourselves (frequently on the drive over to school or during lunch). mostly, their narratives were really boring! as if the were learning math or something.\nbut my friend jack and i, being smartasses of a theatrical bent, chose to tell an increasingly ridiculous story with him as the protagonist. at first jack was stealing his mother\u0026rsquo;s wedding ring \u0026amp; pirating nintendo games, but soon he was convincing the passerby to worship jimmy wales \u0026amp; questing through hell.\nwhy we were allowed to continue, especially as i began to satirize our teachers\u0026rsquo; conservative \u0026amp; conspiratorial views about politics \u0026amp; religion, is a great mystery. i don\u0026rsquo;t claim they\u0026rsquo;re the best jokes ever written \u0026ndash; a couple of them make me cringe now that i\u0026rsquo;m (mostly) an adult. but, plenty of them are still funny, and i\u0026rsquo;m proud i wrote them in high school. a few people wanted an archive of them, and part of me felt like sharing. so, here we are.\nreal people also appear in the math problems often, and how they are portrayed has very little to do with their actual behavior. people jack and i knew personally appeared in the problems with their consent, and they usually chose in which roles they would be appearing. some names have been changed or omitted entirely.\nseason one: the tale of a wayward jack math problem one: humble beginnings\nmath problem two: piracy is not a victimless crime\nmath problem three: in the criminal justice system, copyright violations are considered especially heinous\nseason two: twilight of the wiki god math problem four: enter jimbo\nmath problem five: enter the grim reaper\nmath problem six: jack hits the road\nmath problem seven: the chase and the xbox\nmath problem eight: ah, for just one time, i would take the secret passage, to find the hand of chaser reaching down to mexico\nproblema de matemáticas nueve: jack aprende español\u0026hellip;despacito\nmath problem ten: our hero leads a wayward fornicator to faith in jimmy wales\nmath problem eleven: the end of the road\nintermission one: the clash of the gods\nseason three: jackhammer 40k math problem twelve: to answer this one, we need to talk about parallel universes\nintermission two: jack\u0026rsquo;s revenge\nmath problem thirteen: of triangles and taxes\nmath problem fourteen: the one joke you have to make about money in the future\nmath problem fifteen: our hero changes his mind\nmath problem sixteen: the beginning of the end\nmath problem seventeen: the passion of the jack\nseason four: the harrowing of heck math problem eighteen: paradiso\nmath problems nineteen and twenty: sandwich man at the bridge of death\nmath problem twenty - one: purgatorio\nmath problem twenty - two: enter gigaphil\nmath problem twenty - three: waterever ya say, boomer\nmath problem twenty - four: millennial darn\nmath problem twenty - five: of goth and goth hunter\nmath problem twenty - six: of sinners and samurai\nmath problem twenty - seven: the black lake of degenerates\nmath problem twenty - eight: christmas special!\nmath problem twenty - nine: high school faces eternity\nmath problem thirty: the parable of the single man and shaggerus\nmath problem thirty - one: the hivemind\nmath problem thirty - two: la música del diablo\nmath problem thirty - three: chase\u0026rsquo;s evergaol\nmath problem thirty - four: of grindr and meat grinder\nmath problem thirty - five: demons are a girl\u0026rsquo;s best friend\nmath problem thirty - six: two true scotsmen\nmath problem thirty - seven: the deepest pit of heck\nintermission three: a cat that really is gone\nseason five: parousia math problem thirty - eight: tesla man - least of the archons\nmath problem thirty - nine: cornpop is a bad dude\nmath problem forty: it\u0026rsquo;s the end of the line of the final journey\nepilogue: the eschatological victory of jack\n","title":"The Many Problems of Jack"},{"date":"2023-05-17","image":"","imageAlt":"","link":"//localhost:1313/humor/aaa/1/","summary":"This post is guest - written by Zippity O\u0026rsquo;Neil, who has gained much notoriety as a collector of DUIs and parking tickets. Zippity lives in Birmingham, Alabama, where he can regularly be found borrowing money from loan sharks in order to pay his car insurance bills.\nHey, y\u0026rsquo;all, name\u0026rsquo;s Zippity, and I\u0026rsquo;m gonna learn you the right way to drive them cars. And I ain\u0026rsquo;t talking about that BS they teach youngins out them driving schools - I\u0026rsquo;m talking about the real deal.","tags":["Assorted Awful Advice","Humor"],"text":"this post is guest - written by zippity o\u0026rsquo;neil, who has gained much notoriety as a collector of duis and parking tickets. zippity lives in birmingham, alabama, where he can regularly be found borrowing money from loan sharks in order to pay his car insurance bills.\nhey, y\u0026rsquo;all, name\u0026rsquo;s zippity, and i\u0026rsquo;m gonna learn you the right way to drive them cars. and i ain\u0026rsquo;t talking about that bs they teach youngins out them driving schools - i\u0026rsquo;m talking about the real deal. you follow them\u0026rsquo;s advice, and you\u0026rsquo;ll be one of them sheep who drives below the speed limit. you listen to my ten step program, and you\u0026rsquo;ll be a certified ʀᴏᴀᴅᴡᴀʀʀɪᴏʀ - unchallenged ruler of the highway.\n1.) cuss at them other drivers. look out at all those sobs around you - having the audacity to be there all over your road, getting you stuck in traffic, driving around in their ugly - ass smartcars, cutting you off. it just makes me sick. most of us suppress our disgust at them, but you shouldn\u0026rsquo;t. mamma ain\u0026rsquo;t listening and you ain\u0026rsquo;t in no church, so give into your anger. work yourself up into a frenzy of spiritual excitement like a pentecostal minister speaking in tongues, let obscenities erupt from your mouth like magma from mount saint hellens. let those bastards know that this is your road.\n2. remember you always have that right of way. them \u0026ldquo;teachers\u0026rdquo; of driving in this world want you to believe that you don\u0026rsquo;t always have the right of way. who the hell do they think they are? you\u0026rsquo;re the ʀᴏᴀᴅᴡᴀʀʀɪᴏʀ for heaven\u0026rsquo;s sake! this is your road, if one of them trespassers thinks otherwise, let him know thy fury!\n3.) throw them turtle shells at cars in front of you. this is a trick invented by a noted italian ʀᴏᴀᴅᴡᴀʀʀɪᴏʀ. though any turtle shells will work fine, blue ones are ideal.\n4.) drink them beers while you\u0026rsquo;re driving. i\u0026rsquo;ll tell you a little secret, child. after you\u0026rsquo;s been driving for a while, it just stops being that hard. but, a true ʀᴏᴀᴅᴡᴀʀʀɪᴏʀ never takes the easy path, so you\u0026rsquo;ll need something to add another degree of difficulty. this is where alcohol comes in.\n5.) give them coppers the bird. i swan, them coppers are the most exasperating sons of bitches on god\u0026rsquo;s flat earth! they\u0026rsquo;ll take some random, unassuming guy, pull him over, and take away his licence for three months because i was going 95 in the suburbs of mobile! wait \u0026hellip; editor, cut that part out!\n6.) put them controversial bumper stickers on your car. you can\u0026rsquo;t just be driving around like one of them sheeple who don\u0026rsquo;t wanna offend nobody - you\u0026rsquo;re the dad - burn ʀᴏᴀᴅᴡᴀʀʀɪᴏʀ! you\u0026rsquo;ve gotta piss off those other fellas. they\u0026rsquo;re on your road so they deserve it! best way to do this is to put as many offensive bumper stickers on your car as possible! put a confederate flag there, put one up about black power, add a little something - something about gay people \u0026hellip; you get the picture.\n7.) ignore them check engine lights. check engine lights were put there by the insurance companies to get you to take your car in more often than it needs. they\u0026rsquo;re just useless!\n8.) collect them catalytic converters from your fallen enemies. if you\u0026rsquo;re a good ʀᴏᴀᴅᴡᴀʀʀɪᴏʀ, then you\u0026rsquo;ll have rammed into many sissy smartcars. usually there ain\u0026rsquo;t nothing of value to salvage from them, but every so often you can salvage a catalytic converter and make bank.\n9.) remember that you are a sovereign citizen. this is a good thing to bring up when them coppers come after you. the government is actually a bankrupt corporation, and you don\u0026rsquo;t owe them nothing.\n10.) piss into that gas tank of yours. this is a great way to way to avoid having to pay for or siphon gas. sufficiently alcoholic piss is a real good fuel substitute, and it should be sufficiently alcoholic if you follow step four regularly.\n","title":"Assorted Awful Advice Part One: Driving"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/epilogue/","summary":"Though the antichrist was able to render Jack unconscious and cast him into a coma, Pastor Jim and his armada of Florida men were able to prevail over the beast in the end. Having been defeated, Chase returned to Heck. But this time, as he had been the antichrist, he was numbered among the worst and gravest of sinners; leading to his imprisonment in the deepest and darkest pit of Heck.","tags":["Humor","Math Problems","Math Problems Season 5"],"text":"though the antichrist was able to render jack unconscious and cast him into a coma, pastor jim and his armada of florida men were able to prevail over the beast in the end. having been defeated, chase returned to heck. but this time, as he had been the antichrist, he was numbered among the worst and gravest of sinners; leading to his imprisonment in the deepest and darkest pit of heck. but, as our heroes learned earlier, it is the most sublime, pleasant, and sexually stimulating of them all. so, all things considered, this was a win for him.\nour heroes (except for jack, who was still in a coma) found themselves in a world in which, though not completely marred by the archons, had still been afflicted by them. so, philip lead the push to renew the world.\njust as through one man, the antichrist, all were to be made cringe, so through one man, philip, all were made based. just as through one man the many would be made soyjacks, so through one man the many were made chads. but each in its own order: philip, the firstfruits, and then those like philip on his arrival. then came the end, when he destroyed every archon and authority and power. (the last enemy to be destroyed was the irs) then, when philip had put all things in subjection under his feet, he subjected himself to jack, so that jack might be all in all.\nin kingdom of jack, all influence of the archons has been expunged. as pastor jim foretold long ages ago, fast food restaurants other than chick-fil-a have been abolished - never again will anyone get fries and a drink without being wished a blessed day. mandatory vaccinations have been replaced with injections of various veterinary medicines, and breatharianism is now accepted nutritional orthodoxy. the gays have been returned to the closet, and the only legal use of the word \u0026ldquo;gay\u0026rdquo; is as a schoolyard insult. everyone has admitted what they all knew from looking at the trees all along: that there is no god but god and pastor jim is his messenger. at pastor jim\u0026rsquo;s bidding, creationism has been returned to public schools. indeed, all teaching of mainstream science has been outlawed, and science curricula are now solely based on kent hovind lectures. nevermore will anyone see violence in movies nor sex on tv. yea verily, sex has been abolished. the moon landing has been revealed as the farce it always was, and everyone knows about agartha. the truth about 9/11 (whatever it is) has finally come out. the birth control, estrogen, micro-plastics, and fluoride that the archons put in the drinking water has been replaced with nugenix total-t testosterone booster, which has made all fricking frogs straight.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Epilogue: The Eschatological Victory of Jack"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/40/","summary":"Jack and his friends run into Jeffery Epstein\u0026rsquo;s house, frantically searching for George Soros and Klaus Schwab - the last two of the archons.\n\u0026ldquo;Wait,\u0026rdquo; says Philip, \u0026ldquo;I hear them on the balcony upstairs, the one overlooking the ocean! They\u0026rsquo;re talking in Latin, must be summoning the antichrist right now.\u0026rdquo;\nThey rush up the stairs like there\u0026rsquo;s no tomorrow. With the power of four demigods, Shaggy, Philip, Jack, and Jimmy Wales burst through the door out onto the balcony.","tags":["Humor","Math Problems","Math Problems Season 5"],"text":"jack and his friends run into jeffery epstein\u0026rsquo;s house, frantically searching for george soros and klaus schwab - the last two of the archons.\n\u0026ldquo;wait,\u0026rdquo; says philip, \u0026ldquo;i hear them on the balcony upstairs, the one overlooking the ocean! they\u0026rsquo;re talking in latin, must be summoning the antichrist right now.\u0026rdquo;\nthey rush up the stairs like there\u0026rsquo;s no tomorrow. with the power of four demigods, shaggy, philip, jack, and jimmy wales burst through the door out onto the balcony. they see klaus schwab and george soros standing over a pentagram in goofy black robes.\nklaus schwab turns towards them, and he begins to cackle maniacally. \u0026ldquo;you are too late! ze ritual is completed.\u0026rdquo; he turns toward the ocean. \u0026ldquo;rise! rise my precious!\u0026rdquo;\nwith horror, jack gazes over the railing. and lo, he sees a beast rising out of the sea, and out of its mouth pour words of blasphemy (or maybe they\u0026rsquo;re racial slurs, he isn\u0026rsquo;t really sure). it is a huge, humanoid fox with blue fur. it at least a hundred feet tall, clothed in nothing but a fedora atop its head and an angels and airwaves hoodie upon its back.\nit turns towards them, and jack is horrified by what he sees. \u0026ldquo;you dirty pilgrims!\u0026rdquo; the beast bellows. \u0026ldquo;you found my ass in heck, but you left me there because that sandwich huffin\u0026rsquo; jewish piece of shit don\u0026rsquo;t like the things i say about his race!\u0026rdquo;\ncold, hard realization comes over jack. \u0026ldquo;chase?\u0026rdquo;\n\u0026ldquo;you bundle of sticks, i was once chase, but now i\u0026rsquo;ve been reborn as the damn antichirst! i\u0026rsquo;m gonna rule the whole damn world! but first, i gotta deal with you. you and that sandwich - gobbling jew!\u0026rdquo;\n\u0026ldquo;like, zoinks!\u0026rdquo; yells shaggy, trying to flee in panic.\nbut, chase raises his right hand, and his psychic powers blaze forth. slightly lewd furry art fills minds of his foes - making them fall to their knees in pain. chase wades towards them, preparing to strike.\n\u0026ldquo;so this is how it ends,\u0026rdquo; jack says. \u0026ldquo;i\u0026rsquo;ve done all this toil, gone on this journey through death and hades, and it was all for naught. the antichrist is here, and there\u0026rsquo;s nothing we can do to oppose him. he\u0026rsquo;ll conquer the world and destroy liberty. he\u0026rsquo;ll make eating raw meat and taking horse dewormer a thing of the past.\n\u0026ldquo;but still,\u0026rdquo; he says on a more somber note, \u0026ldquo;i\u0026rsquo;m glad that you are here with me, shaggy, here at the end of all things.\u0026rdquo; \u0026ldquo;like \u0026hellip; zoinks?\u0026rdquo; shaggy responds weakly, collapsing from exhaustion immediately after.\nbut, just as all hope is lost, jack sees something out of the corner of his eye.\nbehind chase, there is a veritable armada of florida men, and at their head stands pastor jim, king james bible in hand, ready to do combat. they have come on their pet gators, their boogie boards, and their nuclear powered house boats; armed with their beer, their mosquito nets, and their squirt guns filled with piss.\n\u0026ldquo;light him up, boys!\u0026rdquo; screams pastor jim, and the armada and the beast begin their duel. jack wants to join them in fighting the good fight, but he feels himself loosing consciousness, the furries of chase are simply too much.\nif there are 22,244,823 people in florida and roughly half of these are men, how many are florida men? if about an eighth of these have come to do battle with the antichrist, how many of them are there?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Forty: It's the End of the Line of the Final Journey"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/39/","summary":"Jack and his crew steal Elon Musk\u0026rsquo;s fastest UFO and return once more to the Earth. They land on Jeffery Epstein\u0026rsquo;s island - now restored to its previous glory - to find Joe Biden and Bill Clinton standing in front of the door.\n\u0026ldquo;What the hell kid?\u0026rdquo; asks Bill Clinton. \u0026ldquo;I thought you died!\u0026rdquo;\n\u0026ldquo;I was once slain, but now I live. I am Jack, conqueror of death!\u0026rdquo;\nBill is about to respond, but he\u0026rsquo;s cut off by the other archon.","tags":["Humor","Math Problems","Math Problems Season 5"],"text":"jack and his crew steal elon musk\u0026rsquo;s fastest ufo and return once more to the earth. they land on jeffery epstein\u0026rsquo;s island - now restored to its previous glory - to find joe biden and bill clinton standing in front of the door.\n\u0026ldquo;what the hell kid?\u0026rdquo; asks bill clinton. \u0026ldquo;i thought you died!\u0026rdquo;\n\u0026ldquo;i was once slain, but now i live. i am jack, conqueror of death!\u0026rdquo;\nbill is about to respond, but he\u0026rsquo;s cut off by the other archon.\n\u0026ldquo;shabapaduba?\u0026rdquo; joe biden questions, gesturing vaguely towards kaegan with a befuddled expression on his face. \u0026ldquo;i-i coulda sworn, man. that right there is corn pop! he\u0026rsquo;s a bad dude, usedta run a buncha bad boys\u0026hellip;\u0026rdquo;\nkaegan throws up his hands. \u0026ldquo;i don\u0026rsquo;t know bro. i ain\u0026rsquo;t named corn pop. there are 8 billion people in the world and only one corn pop. i probably ain\u0026rsquo;t him.\u0026rdquo;\nbiden grows angry and begins foaming at the mouth. \u0026ldquo;come on man! you ain\u0026rsquo;t black, you lying, dog - faced pony soldier! you\u0026rsquo;re a corn pop \u0026lsquo;cause i says you\u0026rsquo;re a corn pop!\u0026rdquo; the politician throws his head back in anger and thrusts forwards his right hand. \u0026ldquo;biden blast!\u0026rdquo; he screams in fury, causing a blue pulse of energy to arc between his hand and kaegan, - reducing the later to a pile of ashes.\n\u0026ldquo;no!\u0026rdquo; screams hayden. \u0026ldquo;they killed kaegan!\u0026rdquo;\n\u0026ldquo;you bastards!\u0026rdquo; i echo.\nfury begins rising in jack\u0026rsquo;s bosom, fury like he\u0026rsquo;s never felt before. his eyes glow red with wrath - the wrath of the god emperor of mankind. the earth begins to shake and thunder roles. \u0026ldquo;lɪsᴛᴇɴ ᴜᴘ, sᴏᴄɪᴀʟɪsᴛ sᴄᴜᴍ!\u0026rdquo; outpours an otherworldly, ferocious voice quite unlike his own. \u0026ldquo;yᴏᴜ\u0026rsquo;ᴠᴇ ᴋɪʟʟᴇᴅ kᴇᴀɢᴀɴ, ʙᴜᴛ ʜᴇ ᴡᴀsɴ\u0026rsquo;ᴛ ᴛʜᴇ ꜰɪʀsᴛ! i ᴋɴᴏᴡ ᴛʜᴇ ʜɪsᴛᴏʀʏ ᴏꜰ ʏᴏᴜʀ sᴏᴄɪᴀʟɪsᴍ! i ᴋɴᴏᴡ ᴛʜᴇ ᴡᴏʀᴅs ʏᴏᴜ ᴄᴀɴ\u0026rsquo;ᴛ sᴛᴀɴᴅ ᴛᴏ ʜᴇᴀʀ, ᴛʜᴇ ᴡᴏʀᴅs ᴛʜᴀᴛ ᴇxᴏʀᴄɪsᴇ ᴀɴʏ ʟɪʙᴇʀᴀʟ ғʀᴏᴍ ᴛʜɪs ᴍᴏʀᴛᴀʟ ᴘʟᴀɴᴇ!\n\u0026ldquo;ɪpʜᴏɴᴇ! \u0026hellip;\n\u0026hellip; vᴇɴᴇᴢᴜᴇʟᴀ! \u0026hellip;\n\u0026hellip; one hundred \u0026hellip;\n\u0026hellip; undecillion \u0026hellip;\n\u0026hellip; dddeeeaaaddd!!!!\u0026rdquo;\nthe fiends cover their ears, trying to shield themselves from those fateful, ruinous words. but, it is to no avail. they begin screeching in pain, and soon are melting away like the nazis at the end of indiana jones and the raiders of the lost ark.\njack sighs. \u0026ldquo;another cuck leftist destroyed.\u0026rdquo;\n\u0026hellip;\nif socialism killed 100 undecillion people, as jack proved with facts and logic, and there are 8 billion people in the world right now (as kaegan stated), then how many orders of magnitude more people has socialism killed then are alive today?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirty-Nine: Cornpop is a Bad Dude"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/38/","summary":"At the crack of Philip\u0026rsquo;s whip, Star in the Morning Sky begins lumbering forwards on her borderline defunct legs. As she reaches 8.8 miles per hour, Jack and his company enter the tunnel of light once more. As they go forward, Jack ceases to be the disembodied ghost he has been, and finds himself arrayed as the god - emperor of mankind once more. His triceps swell, he gains the abs of an anime tomboy, and golden armor covers his body.","tags":["Humor","Math Problems","Math Problems Season 5"],"text":"at the crack of philip\u0026rsquo;s whip, star in the morning sky begins lumbering forwards on her borderline defunct legs. as she reaches 8.8 miles per hour, jack and his company enter the tunnel of light once more. as they go forward, jack ceases to be the disembodied ghost he has been, and finds himself arrayed as the god - emperor of mankind once more. his triceps swell, he gains the abs of an anime tomboy, and golden armor covers his body.\n\u0026ldquo;wait, something\u0026rsquo;s wrong!\u0026rdquo; philip declares with manly yet apprehensive perturbance. \u0026ldquo;earth isn\u0026rsquo;t up ahead! this darned horse is taking us to the moon!\u0026rdquo;\nbut, before philip can stop anything, the tunnel of light vanishes, and the carriage grinds to a halt on solid, firmly material ground. jack closes his eyes, expecting to die like an imposter thrown out of the airlock. but, he doesn\u0026rsquo;t. he breathes in and slowly opens his eyes, finding himself still very much alive.\nthey step outside the carriage to find themselves in a hideous moon base, made entirely of plastic - exactly like every generic spaceship on tv.\n\u0026ldquo;what the hell is going on! wikipedia doesn\u0026rsquo;t say anything about there being a base like this on the moon!\u0026rdquo; says jimmy wales.\na strange, a.i. generated cackling sounds behind them. \u0026ldquo;ha. ha. ha. you are fools.\u0026rdquo;\njack turns around wildly and draws his sword, but he only sees an expensive - looking tesla car. but then, its parts begin shifting into a new form - the form of a huge man made of plastic and steel.\n\u0026ldquo;like zoinks! it\u0026rsquo;s a transformer!\u0026rdquo; shaggy proclaims.\n\u0026ldquo;before my augmentation, i was called elon musk, and i am the least of the archons. how dare you trespass on my moon base?\u0026rdquo;\n\u0026ldquo;wait, this is totally fake!\u0026rdquo; i say. \u0026ldquo;how come no one found this place when people went to the moon? there has to be a naturalistic explanation for this.\u0026rdquo;\n\u0026ldquo;no, no one ever went to the moon. this is where ufos hail from, and it has been so since the time of the ancient egyptians. to keep the mortals from discovering them, they were forbidden from coming to the moon.\u0026rdquo;\njust as i am about to respond, jimmy wales jumps into action and begins doing battle with elon musk - quoting negative statistics about spacex and tesla all the while. the fight is long, hard, and brutal. but, in the end, the african american businessman falls to his knees in subjection.\n\u0026ldquo;no! you may have defeated me, but you cannot defeat the other archons! you are on the road to destruction! all of your base are belong to us! the others are gathered at jeffry epstein\u0026rsquo;s island, and they will summon the antichrist in 37 minutes, bringing about the end times. my fastest ufo will get you there in 27 minutes. how long, pray tell, will that leave you to fight them?\u0026rdquo;\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirty-Eight: Tesla Man - Least of the Archons"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/37/","summary":"Jack and his compatriots steel themselves for what\u0026rsquo;s ahead, for they know the next circle of Heck is deepest and darkest one, home to the greatest of sinners. It is the place where the soul Jack must rescue for his quest is said to dwell.\nBut, when they get there, they\u0026rsquo;re pleasantly surprised. It just looks like a bar. Some lit EDM beats are playing in the background, and the stench of beer can be detected everywhere.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"jack and his compatriots steel themselves for what\u0026rsquo;s ahead, for they know the next circle of heck is deepest and darkest one, home to the greatest of sinners. it is the place where the soul jack must rescue for his quest is said to dwell.\nbut, when they get there, they\u0026rsquo;re pleasantly surprised. it just looks like a bar. some lit edm beats are playing in the background, and the stench of beer can be detected everywhere. and \u0026hellip;\noh.\nthere are many sensuous, scantily - clad succubi gyrating atop the tables. it\u0026rsquo;s not just a bar, it\u0026rsquo;s a strip club!\n\u0026ldquo;woah.\u0026rdquo; says keagan. \u0026ldquo;i\u0026rsquo;m not like, down bad for the forces of darkness or anything, but them succubi are downright callipygian.\u0026rdquo;\njack sees two people he knew in life: jimmy wales and his old pal alvin mcgee. both of them are sitting at a table, ogling a particularly voluptuous succubus of korean extraction.\n\u0026ldquo;yo, al, jimmy wales, why is this circle of heck so fun? isn\u0026rsquo;t it supposed to be like for the worst of the worst?\u0026rdquo;\n\u0026ldquo;oh, hey jack,\u0026rsquo; i say, taking my eyes of off my favored succubus for a second. \u0026ldquo;well, this circle of heck sucked for a long time. the archangel samael was ordered to create it in order to house truly grave sinners, like rapists and nimbys. it was supposed to be based on the sadistic fantasies some religious people had about what would happen to their enemies in the afterlife, all that stuff you find in dante\u0026rsquo;s inferno, the apocalypse of peter, and some of tertullian and arthur pink\u0026rsquo;s writings on the subject. there were people liquefying in flames, guys being hung from the roof by their testicles, everybody being eaten by worms, something about a girl being painted blue. it was horrible!\n\u0026ldquo;but then a bunch of people realized all that was evil balderdash, so c.s. lewis invented this idea where heck is just voluntary separation from god! he published a book about this in 1945, and then 10% of people came to agree with him per decade. when this more humane portrait of eternal \u0026ldquo;punishment\u0026rdquo; came to predominate in the popular imagination, the gates of this circle of heck became locked from the inside.\n\u0026ldquo;but, that meant old sammie needed to invent a reason for people not to leave (saint peter would be very angry if all these supposedly sequestered sinners just showed up in heaven demanding to be left in. nobody wants a postmortem refugee crisis!. so, after sleeping on it, the good angel hired the succubi to make this circle a bit more appealing to its inhabitants. after all, everyone in heck has an unreasonably strong libido and there ain\u0026rsquo;t no sex in heaven, so nobody who was sent here has ever left (a couple of them tried before they heard about the renovations, but the good archangel flagged them down on the road to heaven and said something along the lines of \u0026ldquo;please come back, there are boobs now. i heard you liked boobs.\u0026rdquo;)\nnone of the women were fooled by this, not even the ones who were into girls in the first place, but almost every man in this circle happily took samael up on his offer.\n\u0026ldquo;philip, calculate what year everything changed.\u0026rdquo;\n\u0026ldquo;wait, before i have to do the math on that,\u0026rdquo; begins philip, who apparently became rather knowledgable about theology while in limbo, \u0026ldquo;how do christians who believe in annihilationism or purgatorial universalism, like the church fathers saints theophilus of antioch and gregory of nyssa respectively, fit into this calculation of yours?\u0026rdquo;\n\u0026ldquo;see,\u0026rdquo; i respond, \u0026ldquo;pastor jim says they were postmodern neomarxist libtards, and hence fake christians.\u0026rdquo;\n\u0026ldquo;oh okay,\u0026rdquo; jack says, \u0026ldquo;but i gotta ask, why are you here and how\u0026rsquo;d you get here? i know jimmy was a terrible person and i killed him, but al, you\u0026rsquo;re just a normal guy who writes stupid jokes, occasionally looks at women with lust in his heart, and thinks heroes 4 is a decent game. what did you do to deserve this?\u0026rdquo; suddenly, he gasps and his eyes grow wide with horror, \u0026ldquo;you didn\u0026rsquo;t become an nimby, did you!?\u0026rdquo;\n\u0026ldquo;no, no! even i couldn\u0026rsquo;t sink that low,\u0026rdquo; i respond. \u0026ldquo;it all started when i stopped sending hayden superchats and supporting him on onlyfans. he didn\u0026rsquo;t take to that very nicely and threw me into a meat grinder, but that didn\u0026rsquo;t actually kill me. i only died because, when philip got into a car crash, a beer bottle flew out of his hand and through his open window, eventually making contact with my head and killing me instantly. thankfully, the night before that, i\u0026rsquo;d joined pastor jim\u0026rsquo;s bible church of east pensacola. so, i got saved! but, they ain\u0026rsquo;t got no sex in heaven, and they do have it down here. so, i occasionally mosey on down to the low places for a little, uh, bling bling.\u0026rdquo;\n\u0026ldquo;oh\u0026hellip;okay\u0026hellip;\u0026rdquo; responds jack, wishing he hadn\u0026rsquo;t asked. \u0026ldquo;well, either way, i\u0026rsquo;m getting a burning in my bosom which is telling me that jimmy wales is the guy i was supposed to save from heck for my quest, so he\u0026rsquo;s coming with us. you wanna come, al?\u0026rdquo;\n\u0026ldquo;yeah, sure. they probably have sex in the mortal realm too.\u0026rdquo;\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirty-Seven: The Deepest Pit of Heck"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/37-5/","summary":"Jack and his friends now come to Satan’s throne room in the city of Pandaleerium, which was built to guard the gates of Heck against darned souls seeking to escape. But, Satan’s throne is empty. Beside it stands the goat demon Baphomet, who looks rather tired.\n“What happened to Satan, man? I was looking forward to whipping his ass!” says Philip.\nBaphomet sighs. “Well, see, the left is right, Satan is actually Donald Trump.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"jack and his friends now come to satan’s throne room in the city of pandaleerium, which was built to guard the gates of heck against darned souls seeking to escape. but, satan’s throne is empty. beside it stands the goat demon baphomet, who looks rather tired.\n“what happened to satan, man? i was looking forward to whipping his ass!” says philip.\nbaphomet sighs. “well, see, the left is right, satan is actually donald trump. since all of us demons are democrats, we got a bit perturbed when he decided to run as a republican, but at first it wasn\u0026rsquo;t anything serious. then, beelzebub decided to get us twitter and cable news down here, and we truly learned the depths of his depravity. as his drinking and lusting and his hunger for power became known to more and more demons, the demands to do something about this outrageous man grew louder and louder. so, eventually, we threw him out.”\n“oh, so like, are you going to do anything to stop us from leaving heck?”\n“nah, we’re too tired. there ain\u0026rsquo;t no coffee in heck. there’s a carriage over there which will take you back to the mortal world. it’s pulled by a haggard, undead mare named star in the morning sky (cause horse owners name their animals horrible names like that).”\nso, jack and his friends pile into the carriage and return to the mortal world and do battle with the archons.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Intermission 3: A Cat that Really is Gone"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/36/","summary":"The next circle of Heck looks rather peaceful. When Jack first enters it, nothing seems out of the ordinary. All sees is a pot roasting over a campfire, around which sit Shrek and John Duns Scotus.\n\u0026lsquo;Like zoinks!\u0026quot; exclaims Shaggy. \u0026ldquo;Shrek, I was your biggest fan! John Duns Scotus, you were incredibly influential on my understanding of the univocity of theological verbiage! What did you guys do to, like, get darned to Heck!","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"the next circle of heck looks rather peaceful. when jack first enters it, nothing seems out of the ordinary. all sees is a pot roasting over a campfire, around which sit shrek and john duns scotus.\n\u0026lsquo;like zoinks!\u0026quot; exclaims shaggy. \u0026ldquo;shrek, i was your biggest fan! john duns scotus, you were incredibly influential on my understanding of the univocity of theological verbiage! what did you guys do to, like, get darned to heck!?!?!\u0026rdquo;\n\u0026ldquo;ah, i\u0026rsquo;m happy to have shaped ya intellectual formation lad!\u0026rdquo; says john duns scotus, \u0026ldquo;but it ain\u0026rsquo;t us who got our arses darned to heck.\u0026rdquo;\n\u0026ldquo;no laddie,\u0026rdquo; says shrek, \u0026ldquo;we\u0026rsquo;re true scotsmen, and the scots are god\u0026rsquo;s holy and chosen people, so we got saved despite not being part of pastor jim\u0026rsquo;s bible church of east pensacola.\u0026rdquo;\n\u0026ldquo;but, aren\u0026rsquo;t there like, plenty of scotsmen who get darned to heck though?\u0026rdquo;\n\u0026ldquo;no true scot would ever do such a thing!\u0026rdquo; declares john duns scotus. \u0026ldquo;he may wear his kilt and read his glasgow morning herald, but he isn\u0026rsquo;t a true scotsmen! we are the sole true scotsmen in history (george macdonald almost made the cut, but he was far too reasonable for pastor jim\u0026rsquo;s liking). if only two scotsmen in the history of scotland were true scotsmen, and there have been around 700 million scotsmen, what percentage of scotsmen are truly scotsmen?\u0026rdquo;\n\u0026ldquo;wait a second.\u0026rdquo; points out hayden, as observant as he always is, \u0026ldquo;if you bros are saved, then who\u0026rsquo;s in heck here?\u0026rdquo;\nshrek\u0026rsquo;s face darkens. \u0026ldquo;ah laddie\u0026hellip;it\u0026rsquo;s the guy in the pot, a sinner so wicked his own circle of heck was invented to accommodate him!\u0026rdquo; he picks up a spoon, and pulls a screaming rabbit out of the boiling pot.\nsoup slides off of its fur, and it is revealed to be none other than bugs bunny. his teeth chatter a couple of times.\n\u0026ldquo;nyah, what\u0026rsquo;s up doc?\u0026rdquo;\n\u0026ldquo;oh, shut ya carrot hole!\u0026rdquo; exclaims shrek. \u0026ldquo;scotus is the only lad here who\u0026rsquo;s a doctor in anything, and you weren\u0026rsquo;t even talking to him! tell these good people what you\u0026rsquo;ve done.\u0026rdquo;\n\u0026ldquo;nyah\u0026hellip;okay doc, if you\u0026rsquo;re gonna make me\u0026hellip;so, like, i dropped anvils on people, and i blew up some people, and i manufactured many things which are forbidden by the geneva convention while i worked at acme corp.\u0026rdquo;\n\u0026lsquo;fool!\u0026quot; shrieks shrek, \u0026ldquo;tell them the rest, tell them the truth!\u0026rdquo;\n\u0026ldquo;nyah\u0026hellip;oh yeah\u0026hellip;\u0026rdquo; the rabbit stammers, clearly overwhelmed by the enormity of his guilt. \u0026ldquo;once\u0026hellip;i shat on a video game reviewer\u0026rsquo;s face in march of 2011.\u0026rdquo;\nhis misdeeds exposed, shrek casts the reprobate rabbit back into his pot with a growl of disgust.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirty-Six: Two True Scotsmen"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/35/","summary":"As Jack and his ever expanding band of merry men journey their way into the new circle of heck, they hear millions of people throwing up as one. As they come within sight of the darned here, they see a huge mass of pregnant women, all of whom appear to be deep in the throes of morning sickness.\n\u0026ldquo;Dear God!\u0026rdquo; exclaims Jack \u0026ldquo;What brought them to this miserable state?\u0026rdquo;\nPhilip sighs.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"as jack and his ever expanding band of merry men journey their way into the new circle of heck, they hear millions of people throwing up as one. as they come within sight of the darned here, they see a huge mass of pregnant women, all of whom appear to be deep in the throes of morning sickness.\n\u0026ldquo;dear god!\u0026rdquo; exclaims jack \u0026ldquo;what brought them to this miserable state?\u0026rdquo;\nphilip sighs. \u0026ldquo;this is where believers in feminism go - that doctrine which pastor jim declared leads women to leave their husbands, kill their babies, practice witchcraft, destroy capitalism, and become lesbians. in service of this false religion, the darned in this circle of heck refused to be barefoot and pregnant housewives, so now they are forced to be both barefoot and pregnant \u0026hellip; unto eternal ages.\n\u0026ldquo;every woman born after 1993 has bought into feminism \u0026ndash; none of them can cook, all they know is mcdonald\u0026rsquo;s. if about half of people are women and two and a half billion people have been born since 1993, how many people will end up here?\u0026rdquo;\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirty - Five: Demons are a Girl's Best Friend"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/34/","summary":"Relax to these enchanted beats while reading and working out the math problem for a fuller experience. Or cower in fear of them, if you\u0026rsquo;ve played Terraria\nJack and his friends now come upon a lovely, wooded forest. Pixies play in the puddles, alicorns nibble at the grass, and rainbows grace the sky.\n\u0026ldquo;Wait a cotton - pickin minute!\u0026rdquo; Exclaims Jack \u0026ldquo;This doesn\u0026rsquo;t look like Heck!\u0026rdquo;\n\u0026ldquo;Oh yes, it is.\u0026rdquo; Says Philip \u0026ldquo;This is where gay people and murderers go.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"relax to these enchanted beats while reading and working out the math problem for a fuller experience. or cower in fear of them, if you\u0026rsquo;ve played terraria\njack and his friends now come upon a lovely, wooded forest. pixies play in the puddles, alicorns nibble at the grass, and rainbows grace the sky.\n\u0026ldquo;wait a cotton - pickin minute!\u0026rdquo; exclaims jack \u0026ldquo;this doesn\u0026rsquo;t look like heck!\u0026rdquo;\n\u0026ldquo;oh yes, it is.\u0026rdquo; says philip \u0026ldquo;this is where gay people and murderers go. apparently, the powers that be thought that it would be really cruel to force murderers to be in peaceful, enchanted forest forever. gay people go here because dante said they went to the same place murderers did a thousand years ago, and nobody bothered to question him since then. the murderers really hate it here, but most of the gay people like it fine.\u0026rdquo;\nthen, they see their old friend hayden there.\n\u0026ldquo;holy cinnamon crunch toast fuck!\u0026rdquo; howls jack \u0026ldquo;hayden, are you a practicing homosexual!?\u0026rdquo;\nhayden cringes a second and hangs his head in shame. \u0026ldquo;no, i\u0026rsquo;m a murderer.\u0026rdquo;\njack lets out a sigh of relief and shrugs. \u0026ldquo;oh, well that\u0026rsquo;s not so bad. how\u0026rsquo;d it happen?\u0026rdquo;\n\u0026ldquo;well, i became a really famous video game streamer before i died, and one of my top super - chatters decided to stop donating, so i threw him into a meat grinder. i was fleeing the scene on my 500 euro bicycle, and then that philip hit me full on with his car, although he tried to swerve away, leading him to smash into the car chase and kaegan were in. i got darned to heck because i didn\u0026rsquo;t learn the world was created last thursday at pastor jim\u0026rsquo;s bible church of east pensacola. if my body weighed 195.5 pounds and accelerated away at 172 m / s second after i got hit, how many newtons of force did philip hit me with?\u0026rdquo;\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirty-Four: Of Grindr and Meat Grinder"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/33/","summary":"🍺Listen to this song while working out the math problem, and you may escape the ghastly punishment forced upon Chase by the powers that be🇩🇪\nJack and his motley crew walk on into the next circle of Heck, which they know is now home to their old friend Chase. At first, it seems very pleasant. It just looks like a normal bar, though an impeccably clean one.\nBut then\u0026hellip;they see Chase.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"🍺listen to this song while working out the math problem, and you may escape the ghastly punishment forced upon chase by the powers that be🇩🇪\njack and his motley crew walk on into the next circle of heck, which they know is now home to their old friend chase. at first, it seems very pleasant. it just looks like a normal bar, though an impeccably clean one.\nbut then\u0026hellip;they see chase.\nhe is seated upon one of the bar stools, wide eyed and terrified. a hose is stuck into his mouth, leading up to the beer kegs. he cannot stop consuming the beer, even if he wishes to. he is forced to imbibe it for eons, and this has done bad things to his body. the poor fella now has the figure of a full water balloon, and thank heavens we don\u0026rsquo;t know what his liver looks like.\n\u0026ldquo;oh, no!\u0026rdquo; declares philip, with a macho combination of disgust and sorrow. \u0026ldquo;i now know what happened to this poor, poor fool. many years ago, he committed a grave sin with no one else ever had - he slandered the german language. he said that it sounded \u0026ldquo;unpleasant\u0026rdquo; and \u0026ldquo;shitty\u0026rdquo; and all sorts of other things. now, for his offense against the reich, he is forced to guzzle every last ounce of beer produced by the german nation since its foundation. if every german man, woman, and child produces 10,827 gallons of beer per month (as is common knowledge) and germany was unified in 1871, how many gallons of beer were there for chase to drink in 2023? worse than this, however, is that he must pay for it all, and he will not get out until he pays the last penny.\u0026rdquo;\nthey think about freeing chase, but it turns out that shaggy is jewish. therefore, he considers chase\u0026rsquo;s antisemitic remarks deeply offensive. at his behest, they elect to leave chase to his ghastly fate.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirty-Three: Chase's Evergaol"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/32/","summary":"🎵 Escucha a esta canción mientras trabajas en el problema para una experiencia más completa 🎵**\nJack and his motley crew hear howling up ahead. They see a huge mass of red men with horns and pointed tails stabbing people repeatedly with pitchforks. Yet, he also sees his old friend Kaegan sitting next to them, looking extremely bored.\n“Yo, bro!” he says, “Chase and I died because Philip slammed into us going 95 a few years back.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"🎵 escucha a esta canción mientras trabajas en el problema para una experiencia más completa 🎵**\njack and his motley crew hear howling up ahead. they see a huge mass of red men with horns and pointed tails stabbing people repeatedly with pitchforks. yet, he also sees his old friend kaegan sitting next to them, looking extremely bored.\n“yo, bro!” he says, “chase and i died because philip slammed into us going 95 a few years back. we got sent to heck because neither of us were members of pastor jim’s bible church of east pensacola! i’ve been in this circle of heck ever since then! this is the circle of heck for people who listen to devil music, now that they’re dead, the devils are teaching them that satanism isn’t actually fun and gay, it’s actually very sharp and pointy.”\n“but, like dude, why aren’t these dudes poking you?” asks shaggy.\n“okay bro, lemme explain this,” kaegan says, “so, every time you listen to a piece of devil music, these fellas poke you with a pitchfork 3.636 times every year. but, i like only listened to one devil song while i was in the car with chase, so mostly this is just really boring. chase, on the other hand, listened to 82,756 devil songs over his lifetime. if he was here, how many times would the devils poke him every year?”\n“wait, why isn’t chase here?” asks jack.\nkaegan’s face darkens. “he did something scandalous, and now inhabits the next circle of heck.”\nbecause kaegen was being poked so rarely, philip is able to cleverly free him without them caring.\n** i needed a song that was 1.) not blasphemous 2.) was devil music and 3.) did not contain any naughty words (pastor jim\u0026rsquo;s bible church of east pensacola does not approve of those). esta canción satisface todos de estes criterios con la excepción de tres, pero mi audiencia es un grupo de gringos y no saben la palabra «cabrón.» \u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirty-Two: La Música del Diablo"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/31/","summary":"💀 Ruin your romantic relationships to the rhythm of Reddit\u0026rsquo;s Theme Song while reading and working out this math problem for a fuller experience 💀\nBefore the gate to the next circle of heck, there stands a morbidly obese titan, one large enough to blow the square cube law to smithereens. Upon his head is a fedora, upon his face, a neckbeard. And, upon his chest is a dirty \u0026ldquo;I FUCKING LOVE SCIENCE!","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"💀 ruin your romantic relationships to the rhythm of reddit\u0026rsquo;s theme song while reading and working out this math problem for a fuller experience 💀\nbefore the gate to the next circle of heck, there stands a morbidly obese titan, one large enough to blow the square cube law to smithereens. upon his head is a fedora, upon his face, a neckbeard. and, upon his chest is a dirty \u0026ldquo;i fucking love science!\u0026rdquo; t-shirt. his body exudes a stench potent enough to strike down the nations, and his face is so hideous as to make medusa look like a new york nine.\n“like zoinks dude!” exclaims shaggy. “who, like, are you dude?”\nthe giant turns toward him with malice in its eyes. “we are the reddit. we are legion.”\n“oh. how, like, are you doing?”\nit cackles – a painful, bone chilling sound which makes jack cover his ears in pain. “in this moment, we are euphoric! not because of any phoney god’s blessing, but because we are enlightened by our own intelligence!\u0026quot; at this, he breaks out into more hideous laughter, as though to demonstrate to the world just how euphoric he is.\n“within us are the souls of all people who have ever made a reddit account. joining reddit is so heinous that the moment a person does it, his soul is sucked down into heck to be absorbed into us! his body is left behind to be possessed by demons \u0026ndash; nasty, ugly things.\u0026quot; he breaks out into loathsome cackling, punctuated by a horrible noise in his throat, like a cat coughing up hairballs.\n\u0026ldquo;granted, this isn\u0026rsquo;t as impressive as it sounds because 74% of all reddit accounts are bots, and every redditor has 17 acconts, \u0026ndash; 16 to upvote his comments \u0026amp; one for porn. if there are 430 million accounts, how many are owned by real people? how many people used reddit before joining us? what percentage of reddit accounts are bots? what percentage are for porn?\nimmediately after the giant finishes speaking, philip jumps into action and pulverises him. we, however, are still left to ponder his questions.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirty-One: The Hivemind"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/30/","summary":"Jack and his compatriots hear cries of pain coming from the circle of Heck ahead. “Like zoinks dude!\u0026quot; quoth Shaggy. “I don’t know what these dudes did, but it must’ve been pretty bad!”\nThen, they finally come upon the most terrifying sight any of them hath seen thus far in Heck. Ahead of them is a boundless room \u0026ndash; stretching on in all directions to infinity. Every few feet, there standeth a very large and extremely angry mandrill with riding crop in hand, spanking away at some poor bastard\u0026rsquo;s backside like there’s no tomorrow.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"jack and his compatriots hear cries of pain coming from the circle of heck ahead. “like zoinks dude!\u0026quot; quoth shaggy. “i don’t know what these dudes did, but it must’ve been pretty bad!”\nthen, they finally come upon the most terrifying sight any of them hath seen thus far in heck. ahead of them is a boundless room \u0026ndash; stretching on in all directions to infinity. every few feet, there standeth a very large and extremely angry mandrill with riding crop in hand, spanking away at some poor bastard\u0026rsquo;s backside like there’s no tomorrow.\n“father philip!” quoth a prisoner, betwixt his shrieks of pain. “i didst know thee in life! father philip, please, send shaggy hither so that he might apply a dab of ointment to my poor, bruised ass, for i am tormented by this apish brute!”\nphilip looketh down upon him with righteous indignation.\n“son, this cannot be done. for thou in thy lifetime didst spank the monkey. now, in death, \u0026rsquo;tis the monkey which spanketh thee. thou wert a perennially single and superlatively horny fellow, and thou lived in a time with top knotch treatment for both tendinitis and carpal tunnel syndrome. thou walked the earth for 42 years and shucked thy corn 21 times daily from the consummation of thy twelfth birthday. how many times didst thou rough up the suspect? for every time thou didst bludgeon the beefsteak, this monkey shalt bludgeon thee 77 times every day. how many times shalt he spank thee over a leap year?\n\u0026ldquo;and besides all this, between us and thou there is a great gulf fixed, so that they who would pass from here to thou cannot; neither can they pass to us, that would come from there.\u0026rdquo;\n\u0026ldquo;fine! fine!\u0026rdquo; quoth the horny man. \u0026ldquo;i pray thee, father, that thou wouldst send shaggy unto my father’s house! for i have five brethren, all of whom jacketh their beanstalks on the daily. let him testify unto them lest they also come into this place of torment!\u0026rdquo;\nand philip said unto him, “they hath lonnie childs and stopmasturbationnow.org; let them hear them.”\nand the horny man replied, “nay, father philip! if one went unto them from the dead, they wouldst repent!”\n“truly i tell thee, if they have not been convinced by lonnie childs and stopmasturbationnow.org, they will not repent even if one rises from the dead.\n\u0026ldquo;besides, i have seen thy brethren\u0026rsquo;s search history. they shalt enjoy it here, methinks.\u0026rdquo;\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirty: The Parable of the Horny Man and Shaggerus"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/29/","summary":"Jack and his friends finally reach the other side of the black sea. Chocking through the stench, they see the portion of Heck reserved for stupid teenagers. Here are imprisoned all the people who tempted Bloddy Mary, engaged in street racing, listened to Stairway to Heaven backtracked, or made love in that one porta potty off of 494.\nTheir punishment is to forever be imprisoned within an enlarged version of the average public high school bathroom.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"jack and his friends finally reach the other side of the black sea. chocking through the stench, they see the portion of heck reserved for stupid teenagers. here are imprisoned all the people who tempted bloddy mary, engaged in street racing, listened to stairway to heaven backtracked, or made love in that one porta potty off of 494.\ntheir punishment is to forever be imprisoned within an enlarged version of the average public high school bathroom. almost every surface is caked in toilet paper, most of which is stained with water, urine, or other, more exotic bodily excretions. the words “bill ❤️ tasha” and \u0026ldquo;trent is a ashole\u0026rdquo; are written on the walls in feces, a substance which is also slathered over the stalls, ceilings, mirrors, and floors at irregular intervals. worst of all, however, are the circle’s inhabitants. they are morbidly obese, unhealthy creatures, with clothing and flesh as filthy as their surroundings.\njack coughs a little. \u0026ldquo;smells like teen spirit.\u0026rdquo;\nlet us assume that this circle of heck was opened in 1960 and that its inhabitants then produced five metric tons of bodily excretions every year. if this number increased exponentially every decade, how many metric tons of bodily excretions would those darned in this circle of heck produce in the year 2020? if a third of that was not properly flushed, how many metric tons of bodily excretions would be left in this circle of heck in 2020?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Twenty-Nine: High School Faces Eternity"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/28/","summary":"A morbidly obese male ghost appears before Jack, dressed in what appear to be a dirty hospital gown. \u0026ldquo;I am the ghost of Christmas future. Grasp the side of my gown, and you shall see the shape of things to come if your quest is unsuccessful.\u0026rdquo;\nJack thinks about it for a second. \u0026ldquo;Fine, I\u0026rsquo;d like to get out of Heck for a while. It can\u0026rsquo;t be worse than this.\u0026rdquo; So, he obeys the ghost, and his surroundings disappear in a rushing wind.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"a morbidly obese male ghost appears before jack, dressed in what appear to be a dirty hospital gown. \u0026ldquo;i am the ghost of christmas future. grasp the side of my gown, and you shall see the shape of things to come if your quest is unsuccessful.\u0026rdquo;\njack thinks about it for a second. \u0026ldquo;fine, i\u0026rsquo;d like to get out of heck for a while. it can\u0026rsquo;t be worse than this.\u0026rdquo; so, he obeys the ghost, and his surroundings disappear in a rushing wind. his eyes open to a terrifying scene.\nhe stands before an open - air stage in geneva. the sky above the city is the color of a television tuned to a dead channel. the masses around him have been successfully culled. soy products, vaccines, and elon musk\u0026rsquo;s neuralink implants have deprived them of all independent thinking. if their dead, empty eyes are any guide, none of these people can even conceive of sticking their genitalia into kfc deep fryers. therefore, freedom is dead.\nup onto the stage steps klaus schwab - the slanderer, the strongman, the god of this world! in his right hand he holds a pitchfork, in his left a dungeons and dragons rulebook. he is arrayed all in black, and his horns can clearly be seen protruding from his head.\nhe begins to speak. \u0026ldquo;hello my vondrous underlings, i have an announcement to make to you. zis night, santa klaus - ze inferior klaus - shall attempt to bring candy canes to ze children. zis is foolish and unnecessary. children have no need of candy canes, zey have all ze bugs zey could possibly vant to eat back home in zeir pods.\u0026rdquo;\nat this, the crowd goes wild, for eating bugs is the only thing they still have any enthusiasm for, after all these years of being fed their high - fructose corn syrup and denied their horse dewormer. but, the archon raises his hand, and they fall silent.\n\u0026ldquo;but afzer tonight, ze inferior klaus shall bozer us no more. indeed, i zink i see him coming right over ze city now.\u0026rdquo;\nand, the dark lord speaks truth. as jack looks on, a flying red sleigh exits hyperspace 704 feet above the ground. elon musk, who has long since forsaken the weakness of his flesh for the cold certainty of steel, is standing 1253 feet due south from santa. musk raises his right robotic arm and lets a high intensity laser beam fly at his the jolly old elf. less than a second later, the sleigh becomes a fireball, and its entourage begin plummeting toward the ground at breakneck speeds. cries of \u0026ldquo;ho! ho! ho!\u0026rdquo; and \u0026ldquo;wwwweeeehhhh!\u0026rdquo; echo throughout geneva. assuming that santa was unable to move any since his exit of hyperspace, and that the intersection of his height and distance from elon form a right triangle, how much distance did elon\u0026rsquo;s laser beam have to travel?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Twenty-Eight: Christmas Special!"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/27/","summary":"Jack and his companions see a great black lake in front of them, on the other side of which lie the circles of Heck dedicated to degenerate high school students. At first they think it is impassable, but then they see a motorboat sitting there. Philip, who knows the way Heck works very well, says that this is how they’re meant to cross. So, they all get into it and start sailing.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"jack and his companions see a great black lake in front of them, on the other side of which lie the circles of heck dedicated to degenerate high school students. at first they think it is impassable, but then they see a motorboat sitting there. philip, who knows the way heck works very well, says that this is how they’re meant to cross. so, they all get into it and start sailing. at first, all seems well, but then they are overcome with a putrid, horrible smell. all of them fall over with tears in their eyes except for philip, who maintains his stoic calm.\n“what’s like, happening dude?” shaggy asks through his coughs and tears.\n“that is the stench of the degenerates.” responds philip. “every fifteen minutes, 0.8% of the air we breath becomes replaced by the horrid stench of the next circle of heck. if we will only reach 100% degenerate stench when we are on the other side of the sea, how long will it be?”\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Twenty-Seven: The Black Lake of Degnerates"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/26/","summary":"A Swedish heavy metal band liked this math problem so much they based a song on it. Listen to it while working the problem out for a fuller experience\nAs Jack and his allies come upon a large clearing, the sounds of clashing metal and yelling reach their ears. They see a legion of men dressed in traditional Japanese armor, wielding katanas and 17th century firearms. Opposite them stand a throng of monsters, resembling human beings, but with bulbous, empty eyes; gaping, slobberous mouths; and bulging secondary sex characteristics.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"a swedish heavy metal band liked this math problem so much they based a song on it. listen to it while working the problem out for a fuller experience\nas jack and his allies come upon a large clearing, the sounds of clashing metal and yelling reach their ears. they see a legion of men dressed in traditional japanese armor, wielding katanas and 17th century firearms. opposite them stand a throng of monsters, resembling human beings, but with bulbous, empty eyes; gaping, slobberous mouths; and bulging secondary sex characteristics. on they shamble, hearts filled with nothing but a base hatred for their foes.\n“you are on path to destruction, oni chan!” one of the monsters exclaims.\n“nani!?” cries jack in abject horror. \u0026ldquo;what are these monsters?\u0026rdquo;\nphilip sighs in a empathetic yet ruggedly masculine way. “these are the souls of zoomers and samurai. the zoomers lusted after japanese cartoons in their hearts, so now they have been transformed into them in death. opposite them stand so many brave samurai, who are now forced to see what their once – great nation has exported to the world. these two armies will fight forever more, killing each other every day and rising to fight again each morning.\na volley of gunfire crashes into the zoomers, and several of them fall. yet, another is enraged. it contorts its body into a bizarre, disturbing position and screams “you will grovel before us, for we are men of culture! know your fate! you dddiiieee!!! curse ye ha me ha!”\na blast of white light extends from its hands, and several samurai burst into pillars of ash, obliterated by a burst of unbearable misfortune.\n“like, will these dudes ever like get into hand-to-hand combat?” shaggy asks.\n“oh yes, eventually.” philip responds. “the zoomers are advancing toward the samurai at an average pace of 13 miles per hour. if the samurai are three and a half miles away from them, about how long will it take them to reach their foes?”\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Twenty-Six: Of Sinners and Samurai"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/25/","summary":"(Note 🗒️: Nevermind. I found a funny stereotype about Gen Xers)\nNext up in their journey through Heck, Jack and the gang find themselves in a rainy field filled with the sound of terrible wailing. There is a huge fence, separating those on one side of the field from the other. On one side, there are a horde of souls who were once goths in life. The wear sopping wet, black clothes, with makeup and hair dye running down their bodies.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"(note 🗒️: nevermind. i found a funny stereotype about gen xers)\nnext up in their journey through heck, jack and the gang find themselves in a rainy field filled with the sound of terrible wailing. there is a huge fence, separating those on one side of the field from the other. on one side, there are a horde of souls who were once goths in life. the wear sopping wet, black clothes, with makeup and hair dye running down their bodies. on the other side, there stand a horde of overweight men, all of them wailing in despair.\nphilip sheds a single intense yet manly tear. “the lord has a cruel sense of humor,” he says in a baleful tone. “here, the goths tormented are forever on their side of the fence. they must eternally put up with the rain messing up their makeup, hair dye, and other cosmetic substances. the men on the other side of the fence, by contrast, yearned for nothing more than a simple goth gf. and now, they are forced dwell within sight of those they sought after so long. yet, the goths will not speak to them nor make love to them, for they are overcome with sorrow.”\nas if in response to this, one of the darned lets up out deep, moist - sounding bellow of despair. \u0026ldquo;no goth gf! let grog have goth gf!\u0026rdquo;\n“wait a sec.” jack says, “it looks like there are way more goth hunters than goths.”\n“oh yes,” philip responds, “for every one goth, there are 4*10^8 goth hunters. if there are half a million goths, how many goth hunters must there be?”\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Twenty-Five: Of Goth and Goth Hunter"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/24/","summary":"(Note 🗒️: Gen Xers were skipped due to my inability to think of amusing stereotypes about them)\nOur motley crew has moved on from the boomer fishery and made their way into the next circle of Heck. At first, it seems to be a perfectly normal town, filled with people raising children and doing their jobs. But then, Jack sees that all of the adults have tears streaming down their faces.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"(note 🗒️: gen xers were skipped due to my inability to think of amusing stereotypes about them)\nour motley crew has moved on from the boomer fishery and made their way into the next circle of heck. at first, it seems to be a perfectly normal town, filled with people raising children and doing their jobs. but then, jack sees that all of the adults have tears streaming down their faces.\n“what is this madness?” jack asks. “who are these people and why are they so depressed?”\n“these,” says philip, who is so wise that he knows the ins and outs of the whole afterlife, “are millennials. in life, they refused to have children or jobs and to get off of their parents’ cellular plans. so now, for eternity, they are doomed to work, have families, and pay their own bills.”\na fat man at a hotdog stand checks his phone and bursts into tears. “no! no! my parents won’t let me stay on their hulu subscription anymore! i’d been on that thing for seventeen years, and it cost $79.99 every year! how much money did they save me?” the poor man lets out a blood-curdling wail. “if i’m going to spend every minute of my spare time watching hulu for a hundred and seventy-two years, how much will i pay!”\nthe poor man collapses onto his hotdog stand, overcome by the enormity of his loss, leaving jack to calculate how much money his parents saved him.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Twenty-Four: Millennial Darn"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/23/","summary":"Having moved beyond purgatory and Limbo, Jack, Philip, and Shaggy head down into Heck itself. At first, they appear to be on the side of a normal river. But then, Jack realizes that there are large, anthropomorphic fish and crawdads sitting on the shore, fishing for people swimming around in the water.\n“Uh sir,” Jack asks one of them, “what’s going on?”\n“Well, this is the first circle of Heck. The first few circles aren’t for sins people have individually committed, but rather generational sins they have inherited.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"having moved beyond purgatory and limbo, jack, philip, and shaggy head down into heck itself. at first, they appear to be on the side of a normal river. but then, jack realizes that there are large, anthropomorphic fish and crawdads sitting on the shore, fishing for people swimming around in the water.\n“uh sir,” jack asks one of them, “what’s going on?”\n“well, this is the first circle of heck. the first few circles aren’t for sins people have individually committed, but rather generational sins they have inherited. this circle of heck is where unrepentant boomers are eternally punished. in life, they fished for us, so now we fish for them.” as he finishes, the fish puts a 1960s – era nudie mag on the hook and casts it out into the water.\n“yo, that’s some, like, real gnarly bait bro!” shaggy says. “what else ya got?”\n“we have a total of 17,041 pieces of bait.” the fish says. “26% are nudie mags, 14% are beatles albums, 27% are vietnam war memorabilia, 13% are parts of classic cars, and 20% are tie-dye shirts.”\n“but like, i wanna know the raw numbers dude.”\n“you’ll just have to do the math yourself!”\njust as shaggy gets his notebook and pen out, a boomer latches onto a vietnam war protest sign, and is pulled screaming out of the water. with cruel glee, the fish haul out a boom box.\n“oh hello evans, i’m so happy to see you again.” the fish says with a cruel smile. “we’re gonna make you listen to that newfangled whippersnapper music now!”\nthe boomer screams, but his cry is cut off by a blaring tekashi69 song. jack and his companions cover their ears in pain, but it isn’t enough to save them.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Twenty-Three: Whatever ya say, Boomer"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/22/","summary":"💪 For a fuller experience, lift to these virile tunes while reading and working out the math problem 💪\nAfter wading through the corn – seas of purgatory for what feels like an eternity, Jack and Shaggy finally reach Limbo. Limbo appears to be a huge, indoor gym. For a second, they think that it’s empty, but then, they hear someone deadlifting in the distance. They follow the sound until, at long last, they see a huge beast of a man there.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"💪 for a fuller experience, lift to these virile tunes while reading and working out the math problem 💪\nafter wading through the corn – seas of purgatory for what feels like an eternity, jack and shaggy finally reach limbo. limbo appears to be a huge, indoor gym. for a second, they think that it’s empty, but then, they hear someone deadlifting in the distance. they follow the sound until, at long last, they see a huge beast of a man there. standing at least eight feet tall, the man - beast is in enough muscle to make arnold schwarzenegger green with envy and even the straightest of men say things which sound slightly homoerotic. at first, jack thinks the man’s barbell is loaded down with weights, but then he realizes there’s actually a minivan one either side.\nthe man - if he is a man at all - turns toward them for a second, and jack realizes that it’s his old friend, philip.\n“philip!” jack exclaims, “how’d you end up in limbo?”\n“well, ten years ago, i was killed in a car crash on my way home from a dungeons and dragons game. because of that transgression, and my lack of membership in pastor jim\u0026rsquo;s bible church of east pensacola, i was forbidden from receiving the beatific vision. but, saint peter determined i was too much of a chad to be darned to heck, so i was instead cast into limbo for eternity. five years ago, the lord came unto me in a vision, and told me i had been called to help you oppose klaus schwab and his luciferian agenda. so, i began lifting to better fight the good fight when the time comes.\n“if each of these minivans weighs 3872 pounds, and i’ve been lifting them both every thirty seconds for the past five years, how many times have i lifted them? how much total weight have i lifted?\u0026quot;\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Twenty-Two: Enter Gigaphil"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/21/","summary":"🌽 Shuck to these midwestern beats while working out the math problem for a fuller experience 🌽\nJack and Shaggy find themselves in purgatory, which looks identical to rural Iowa. Corn stretches in all directions as far as the eye can see.\n“Like, where the zoinks are we supposed go dude?” Shaggy asks.\nQueen Elizabeth II stumbles through the shoots of corn. \u0026ldquo;Tally-ho, young sir! What were you saying?” she asks.","tags":["Humor","Math Problems","Math Problems Season 4"],"text":" 🌽 shuck to these midwestern beats while working out the math problem for a fuller experience 🌽\njack and shaggy find themselves in purgatory, which looks identical to rural iowa. corn stretches in all directions as far as the eye can see.\n“like, where the zoinks are we supposed go dude?” shaggy asks.\nqueen elizabeth ii stumbles through the shoots of corn. \u0026ldquo;tally-ho, young sir! what were you saying?” she asks.\n“we’re on a mission from god that requires us to go through heck, and we have no clue how to get there from here.”\n“well, purgatory is the spiritual equivalent of the american corn-growing states, and heck is much hotter than them, so i figure you have to just go south for a long time.”\n“how like, much corn is there here man?” shaggy asks.\n“firstly, you must know the bizarre way purgatory works. the landscape is almost entirely ripped from the american midwest, but it had to be enlarged to accommodate many penetrant sinners, so that now it is 18^6 times larger than its counterpart in the world of the living, which is 610,080 square miles. if, on average, each acre produces 198 bushels of corn, and a square mile contains 640 acres, how many bushels of corn would there be? if every bushel of corn contains 90,000 kernels, how many kernels are there?”\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Twenty-One: Purgatorio"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/1920/","summary":"Saint Peter hands Jack a special, nonexchangeable ID card which will let the angels know he isn’t a darned soul trying to escape Heck, and takes him to the nearest border patrol station leading to heck and purgatory.\nJust ahead of him, Jack sees Shaggy. \u0026ldquo;Like zoinks dude, this is super dooper ungroovy!\u0026rdquo; he says \u0026ldquo;Scoobs must have put some gnarly edibles on my sandwich, because I just hallucinated that Saint Peter condemned my immortal soul to 10,000 years in purgatory!","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"saint peter hands jack a special, nonexchangeable id card which will let the angels know he isn’t a darned soul trying to escape heck, and takes him to the nearest border patrol station leading to heck and purgatory.\njust ahead of him, jack sees shaggy. \u0026ldquo;like zoinks dude, this is super dooper ungroovy!\u0026rdquo; he says \u0026ldquo;scoobs must have put some gnarly edibles on my sandwich, because i just hallucinated that saint peter condemned my immortal soul to 10,000 years in purgatory!\u0026rdquo;\n“uh, shaggy,” jack says, “i dunno how to break it to you, but that wasn’t a hallucination! this is the afterlife!”\n“zoinks! i’m, like dead!” shaggy begins sobbing inconsolably. “oh, i know how it must have happened. i’d like just got back from rehab for food addiction, and i’d lost like a bagillion pounds! they told me my stomach had shrunk to a tenth of its original size, which was exactly 40.436 cubic meters! but see, when i got home, scobby made me a sandwich, and i thought it’d be fine to eat it because it was vegan and healthy and everything. but scobby still made it in the portion size i used to eat, which was 26.728 cubic meters, and i like slurped it down in one bite! how many times larger than my small, puny stomach must it have been? if every 2 cubic meters of super shaggy sandwich contains 500 calories, how many calories did i consume?”\njack does the math in his head, and something strikes him. “wait, shaggy, how in the name of god could your stomach be forty cubic meters? you’re a skinny dude.”\n“people ask me that all the time. truth is that i’m a demi-god, and my stomach’s way bigger on the inside than it is on the outside!”\n“bro, i’m on a quest from the lord to save the world, and having a demigod with me would be really helpful! let’s tell the border patrol agent that, and maybe he’ll let you join me! i get help and you get a get out of purgatory free card.”\nthe tears stop flowing down shaggy’s face. “groovy dude!”\nthey eventually reach the crossing booth, and come face to face with a crouching russian man wearing white adidas.\n“papers, please.” he says.\njack hands over the card saint peter gave him.\n“what you think this is? these are the special cards saint peter give out to people on special mission from god. you clearly not one of those, punk. get better at forging documents.”\njust as the man is about to mark jack as a forger and send him off to heck, he sees shaggy.\n“oh, that you shaggy? i you biggest fan! everyone love you, shaggy! admittedly, only about third of russians know you exist, but there about 187,000,000 people in russia (including ukrainians, of course), so you just do the math yourself! that a lot of people!\n“shaggy, if you believe this man is trustworthy, i trust you. you both continue on through purgatory.”\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problems Nineteen and Twenty: Sandwich Man at the Bridge of Death"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/18/","summary":"😇 Relax to these ethereal, heavenly tunes on loop while working out the math problem for a fuller experience 😇\nJack has finally gotten to the end of the tunnel of light, and now he sees the pearly gates before him. The breathtaking display of heavenly glory is only dampened by an angry-looking Middle Eastern man in a toga.\n“Hey, newly deceased sinner, get ready to be judged!” He screams to Jack “I’m Saint Peter, and your arse is about to find out real fast whether it’s destined for eternal darnnation in Heck or heavenly bliss!","tags":["Humor","Math Problems","Math Problems Season 4"],"text":"😇 relax to these ethereal, heavenly tunes on loop while working out the math problem for a fuller experience 😇\njack has finally gotten to the end of the tunnel of light, and now he sees the pearly gates before him. the breathtaking display of heavenly glory is only dampened by an angry-looking middle eastern man in a toga.\n“hey, newly deceased sinner, get ready to be judged!” he screams to jack “i’m saint peter, and your arse is about to find out real fast whether it’s destined for eternal darnnation in heck or heavenly bliss!”\nhe pauses to go through his notes. “you named jack?” he asks.\n“yeah.” jack says.\n“well, newly deceased sinner, looks like you do stand guilty of plenty of sins against god and man. and you never was a member of pastor jim\u0026rsquo;s bible church of east pensacola, outside of which there is no salvation.\n\u0026ldquo;but, it’s your lucky day, because the lord needs you to go on a mission for him. see, when you was on earth, you kept the powers of darkness in check. but, now that you’re gone all the archons stand completely unopposed! (you know, bill clinton, klaus schwab, joe biden, jeff bezos, that bunch?) if nothing is done to stop them, they will summon the antichrist in 38 minutes.\n“in order to stop them, you must enlist the aid of two souls you knowed when you was alive. one of ‘em is waiting for ya down in limbo, but the other is languishing in the deepest, darkest pit of heck. once you’ve freed both of them, you will be returned to earth to do battle with them powers and principalities.”\n“wait a second!” jack exclaims “how do you expect me to get through the whole bad section of the afterlife in 38 minutes?”\n“oh brotha, don’t worry about that. time passes differently here in the afterlife. for every second that passes down on earth, a three leap years pass up here. just do the math yourself! you’ve got plenty of time!”\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Eighteen: Paradiso"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/17/","summary":"🎵 For a Fuller Experience, Jam to These Retro Tunes While Reading and Working out the Math Problem 🎵\nAs Bill Clinton arrives at Jack’s home, the earth begins to shake. Church bells begin to toll in the distance - a hollow, threatening sound. The sky is stained a dusky green, the color of unpaid tax dollars. The Majora’s Mask Final Hours Theme begins to play loudly, perhaps produced by some ethereal DJ studio.","tags":["Humor","Math Problems","Math Problems Season 3"],"text":"🎵 for a fuller experience, jam to these retro tunes while reading and working out the math problem 🎵\nas bill clinton arrives at jack’s home, the earth begins to shake. church bells begin to toll in the distance - a hollow, threatening sound. the sky is stained a dusky green, the color of unpaid tax dollars. the majora’s mask final hours theme begins to play loudly, perhaps produced by some ethereal dj studio.\nas bill clinton gets out of his car, jack begins second guessing himself. yes, he thinks, i may be the god-emperor of mankind, but does that mean i am the strongest of the gods? could there be powers in this world older and stronger than mine? is there a bigger fish?\njack watches with apprehension as the door’s handle turns and it creaks open. he raises his sword to defend himself, but it is too late. an eldritch blast emanates from bill clinton, exerting 285,295 newtons of force upon jack’s soul. if jack’s soul weights 21.3 grams and is unaffected by friction, both properties souls are widely known to display, how fast will it fly away from his body?\n\u0026hellip;\nthe room around jack vanishes. all he can hear is bill clinton’s maniacal laughter and that cursed music. but, the first of these fades away, while the later grows louder.\njack sees a tunnel of light, and he knows this isn’t the end. yet, his heart freezes. after his use of heroin, his piracy, his idolatry to jimmy wales, his deception of death himself, and his apotheosis in the minds of the people, jack does not believe the abrahamic god will allow him to escape judgment for his sins. as he nears the light, he tries desperately to go back, but to no avail.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Seventeen: The Passion of the Jack"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/16/","summary":"The tax man flies off into the night at a breakneck speed and passes over the horizon. Suddenly, Jack’s phone starts ringing, and he answers it.\n“Jackie boy, I am Bill Clinton, and I know what you just did. I’m coming up there to learn you the right way to treat government officials.”\nBill will be unable to start driving for thirty-six hours because his attractive female intern is visiting the dry cleaners’ in his car.","tags":["Humor","Math Problems","Math Problems Season 3"],"text":"the tax man flies off into the night at a breakneck speed and passes over the horizon. suddenly, jack’s phone starts ringing, and he answers it.\n“jackie boy, i am bill clinton, and i know what you just did. i’m coming up there to learn you the right way to treat government officials.”\nbill will be unable to start driving for thirty-six hours because his attractive female intern is visiting the dry cleaners’ in his car. once he gets it back, bill will start driving from his presidential library in little rock, arkansas to jack’s house in belcarra, british columbia. belcarra and little rock are 2,396.69 miles apart, and bill clinton will be driving at twenty miles per hour the whole way, making no stops. in how many days will bill clinton reach jack?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Sixteen: The Beginning of the End"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/15/","summary":"The tax man greedily snatches Jack\u0026rsquo;s check out of his hands. He turns around and scampers away, his four chins swaying like hay in the wind. But, as his blubbery hand flops onto the door knob, Jack has a change of heart. His body accelerates from a standstill to 1,373 meters per second toward the taxman. If Jack weighs 62 kilograms, how many newtons of force will he exert upon the tax man\u0026rsquo;s body when they make contact, assuming that the air exercises 15 newtons of drag on him?","tags":["Humor","Math Problems","Math Problems Season 3"],"text":"the tax man greedily snatches jack\u0026rsquo;s check out of his hands. he turns around and scampers away, his four chins swaying like hay in the wind. but, as his blubbery hand flops onto the door knob, jack has a change of heart. his body accelerates from a standstill to 1,373 meters per second toward the taxman. if jack weighs 62 kilograms, how many newtons of force will he exert upon the tax man\u0026rsquo;s body when they make contact, assuming that the air exercises 15 newtons of drag on him?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Fifteen: Our Hero Changes his Mind"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/14/","summary":"The tax man completes the previous math problem, and Jack sighs, knowing he’s been beat. He produces a checkbook and writes away 32 trillion dollars. Granted, this isn’t an especially large amount of money nowadays. Since hyperinflation started in 2020, twenty-five years ago, every year the value of the dollar has been an eighth of what it was the year before. What is the amount of money Jack owes equivalent to in 2020 dollars?","tags":["Humor","Math Problems","Math Problems Season 3"],"text":"the tax man completes the previous math problem, and jack sighs, knowing he’s been beat. he produces a checkbook and writes away 32 trillion dollars. granted, this isn’t an especially large amount of money nowadays. since hyperinflation started in 2020, twenty-five years ago, every year the value of the dollar has been an eighth of what it was the year before. what is the amount of money jack owes equivalent to in 2020 dollars?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Fourteen: The One Joke you Have to Make About Money in the Future"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/13/","summary":"One day, Jack walks into his bedroom to find the IRS man standing there, waiting to pounce. He says that Jack\u0026rsquo;s ex-wife owed Bill Clinton 32 trillion dollars in taxes, and that since Jack is marked as her next of kin, he has to pay up. \u0026ldquo;I know you\u0026rsquo;re the god emperor of mankind and all that jazz now,\u0026rdquo; he says, \u0026ldquo;but these are outstanding debts from before that, so you still have to pay up.","tags":["Humor","Math Problems","Math Problems Season 3"],"text":"one day, jack walks into his bedroom to find the irs man standing there, waiting to pounce. he says that jack\u0026rsquo;s ex-wife owed bill clinton 32 trillion dollars in taxes, and that since jack is marked as her next of kin, he has to pay up. \u0026ldquo;i know you\u0026rsquo;re the god emperor of mankind and all that jazz now,\u0026rdquo; he says, \u0026ldquo;but these are outstanding debts from before that, so you still have to pay up.\u0026rdquo; jack asks how he came to owe this money, and the tax man heaves a heavy sigh.\n\u0026ldquo;well, after you went to prison, you ex became romantically involved with bill clinton. but, their relationship ended on less than favorable terms, and after all that bill\u0026rsquo;s been through over the past few decades, that was the last straw. he had a psychotic break and assigned large amounts of tax debt to people for arbitrary reasons. in your ex-wife\u0026rsquo;s case, he assigned it based on the area of a certain isosceles triangle.\u0026rdquo;\n\u0026ldquo;what? how?\u0026rdquo;\n\u0026ldquo;well, the base of the triangle was 8 trillion units across, but we don\u0026rsquo;t know what its height was. all we know is that its area totalled to 32 trillion units, ergo the 32 trillion dollars you now owe to the irs.\u0026rdquo;\njack thought for a second. \u0026ldquo;this sounds phony, like those youtube ads i get saying that if i click on them beautiful asian women will have sex with me. if you can tell me what the height of that triangle was, i\u0026rsquo;ll think about paying up, but otherwise you\u0026rsquo;re gonna be in a world of hurt.\u0026rdquo;\nthe tax man sighed. \u0026ldquo;i was afraid of this. now i\u0026rsquo;ll have to do math!\u0026rdquo;\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Thirteen: Of Triangles and Taxes"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/12/","summary":"Jack has absorbed Jimmy Wales’ essence and become a literal god. He rules the world with an iron fist. But, there is still one thing which his heart desires, one thing which he needs. He needs to finally take revenge on his ex - wife. He must make her pay for what she did to him. Jack couldn’t find any information about her whereabouts, so he captured her family and forced them to watch the Bee Movie until they told him where she was.","tags":["Humor","Math Problems","Math Problems Season 3"],"text":"jack has absorbed jimmy wales’ essence and become a literal god. he rules the world with an iron fist. but, there is still one thing which his heart desires, one thing which he needs. he needs to finally take revenge on his ex - wife. he must make her pay for what she did to him. jack couldn’t find any information about her whereabouts, so he captured her family and forced them to watch the bee movie until they told him where she was.\nbut to answer that question, we need to talk about parallel universes. as a bizarre consequence of some law of physics or another, if you go travel at a speed greater than 2,917 kilometers per hour at the equator, you will be transported into a parallel universe. jack’s ex traveled twenty four parallel universes (6qpu) away from jack. the only known way to build up enough speed to do this is by backward long jumping. you see, if one backwards long jumps fast enough, they won’t gain any kinetic energy but will instead gain potential energy. when you stop backward long jumping, all of your potential energy will instead become kinetic. if every one of jack’s backward long jumps would carry him a hundred yards in three seconds, (jack is the god emperor of mankind, don’t question it), how many backward long jumps will it take to transport him to his wife’s parallel universe?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Twelve: To Answer This one, we Need to Talk About Parallel Universes"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/12-5/","summary":"Jack backward long jumps many times, and then he stops. All of the force hits him immediately. He sees the parallel universes laid out before him and is aware of his traversing them. Then, a second later, he is on the ground in another world.\nJack feels in his bones that his ex wife is close. After just a few minutes of searching, he sees her: his nemesis. It was she that got him addicted to heroin tricked him into stealing his mothers wedding ring.","tags":["Humor","Math Problems","Math Problems Season 3"],"text":"jack backward long jumps many times, and then he stops. all of the force hits him immediately. he sees the parallel universes laid out before him and is aware of his traversing them. then, a second later, he is on the ground in another world.\njack feels in his bones that his ex wife is close. after just a few minutes of searching, he sees her: his nemesis. it was she that got him addicted to heroin tricked him into stealing his mothers wedding ring. jack\u0026rsquo;s power blazes forth. his laser eyes begin to power up and he raises his sword. but, he hesitates. it would be terribly cruel to destroy his ex this way. so instead, like a certain long forgotten zelda boss, she is cast into the gap between dimensions.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Intermission Two: Jack's Revenge"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/115/","summary":"The Grim Reaper’s flying Hearse parks in front of Jack. Death himself climbs out of the car and stands before our hero, ready to rip his soul from his body. But, something stays the reaper\u0026rsquo;s scythe. He does not speak, yet Jack hears his voice echoing inside of his head, somehow \u0026ndash; a strange, grating sound, like the slamming of coffin lids.\nAʀᴛ ᴛʜᴏᴜ ʜᴇ ᴡʜᴏ ʀᴇʙᴇʟʟᴇᴛʜ ᴀɢᴀɪɴsᴛ Jɪᴍᴍʏ Wᴀʟᴇs?","tags":["Humor","Math Problems","Math Problems Season 2"],"text":"the grim reaper’s flying hearse parks in front of jack. death himself climbs out of the car and stands before our hero, ready to rip his soul from his body. but, something stays the reaper\u0026rsquo;s scythe. he does not speak, yet jack hears his voice echoing inside of his head, somehow \u0026ndash; a strange, grating sound, like the slamming of coffin lids.\naʀᴛ ᴛʜᴏᴜ ʜᴇ ᴡʜᴏ ʀᴇʙᴇʟʟᴇᴛʜ ᴀɢᴀɪɴsᴛ jɪᴍᴍʏ wᴀʟᴇs?\n“yes.” jack says in quiet resignation, knowing his fate is neigh.\nwᴇʟʟ, ᴍᴏʀᴛᴀʟ, \u0026lsquo;ᴛɪs ᴛʜɪɴᴇ ʟᴜᴄᴋʏ ᴅᴀʏ. fᴏʀ jɪᴍᴍʏ wᴀʟᴇs ɪs ᴛʜᴇ ᴍᴏsᴛ ᴀɴɴᴏʏɪɴɢ ᴏꜰ ᴛʜᴇ ᴅᴇɪᴛɪᴇs, ᴀɴᴅ ꜰᴏʀ ᴀɢᴇs ʜᴀᴠᴇ i ᴘʟᴏᴛᴛᴇᴅ ʜɪs ᴅᴏᴡɴꜰᴀʟʟ. tʜᴀᴛ ᴍᴀɴ ᴛʜɪɴᴋᴇᴛʜ ʜɪᴍsᴇʟꜰ sᴏ ʜɪɢʜ ᴀɴᴅ ᴍɪɢʜᴛʏ ʙᴇᴄᴀᴜsᴇ ʜᴇ ᴏᴡɴᴇᴛʜ wɪᴋɪᴘᴇᴅɪᴀ, ʏᴇᴛ ᴇᴠᴇʀʏᴏɴᴇ ᴋɴᴏᴡs ᴛʜᴀᴛ uɴᴄʏᴄʟᴏᴘᴇᴅɪᴀ ɪs ꜰᴀʀ ᴍᴏʀᴇ ʀᴇʟɪᴀʙʟᴇ. tʜᴀᴛ ɪᴅɪᴏᴛ ᴅʀɪᴠᴇᴛʜ ᴀʟʟ ᴛʜᴇ ᴄʀᴇᴅᴜʟᴏᴜs ᴍᴏʀᴛᴀʟs ᴛᴏ ᴜsᴇ ʜɪs sʜɪᴛᴛʏ ᴡᴇʙsɪᴛᴇ. aɴᴅ ɪᴛ ᴅᴏᴇsɴ\u0026rsquo;ᴛ ᴇᴠᴇɴ ʜᴀᴠᴇ ᴛʜᴀᴛ ᴍᴀɴʏ osᴄᴀʀ wɪʟᴅᴇ ǫᴜᴏᴛᴇs\u0026hellip;i sᴡᴀɴ\u0026hellip;\nwʜᴇʀᴇ ᴡᴀs i? oʜ, ʏᴇᴀʜ, i\u0026rsquo;ᴠᴇ ʀᴇᴀʟʟʏ ᴡᴀɴᴛᴇᴅ ᴛᴏ ᴅᴏ ᴀᴡᴀʏ ᴡɪᴛʜ ᴛʜᴀᴛ ʀᴀᴛ ʙᴀsᴛᴀʀᴅ ꜰᴏʀ ᴀ ʟᴏɴɢ ᴛɪᴍᴇ, ʏᴇᴛ ᴛᴏ ᴅᴏ sᴏ, i ʀᴇǫᴜɪʀᴇ ᴛʜᴇ sᴇʀᴠɪᴄᴇ ᴏꜰ ᴀ ᴍᴏʀᴛᴀʟ. cᴏɴsɪᴅᴇʀɪɴɢ i sʜᴀʟᴛ sʟᴀʏ ᴛʜᴇᴇ ɪғ ᴛʜᴏᴜ ʀᴇғᴜsᴇ\u0026rsquo;sᴛ, ᴛʜᴏᴜ ᴅᴏsᴛ ɴᴏᴛ ʜᴀᴠᴇ ᴍᴜᴄʜ ᴄʜᴏɪᴄᴇ ɪɴ ᴛʜᴇ ᴍᴀᴛᴛᴇʀ. bᴜᴛ, i ᴡᴏᴜʟᴅ ʀᴇᴀʟʟʏ ᴀᴘᴘʀᴇᴄɪᴀᴛᴇ ɪᴛ ᴛʜᴏᴜ ᴡᴏᴜʟᴅsᴛ ᴀssɪsᴛ ᴍᴇ.\nseeing no other option, jack nods his head. the reaper smiles and reaches out his boney hand to jack, who takes it gingerly.\nyet, this is not the end, for jack is born into the reaper\u0026rsquo;s flying hearse, and the two of them set out to meet jimmy wales.\nwhen they get to wales\u0026rsquo; home, the reaper tells jack to get out of the funerary vehicle. as soon as he does, death himself fills jack\u0026rsquo;s body, possessing him. he takes the scythe from the reaper’s hands and walks toward jimbo\u0026rsquo;s house. the doors silently and without touch, as though their of their own accord. the two enter the foyer, then pass into the dark hallway, until they finally come to jimbo\u0026rsquo;s bedroom. jack sees him lying there on his side, restless.\nhe sits up as jack crosses his doorway, apprehension filling his eyes.\njack and the reaper begin to speak in unison. jɪᴍᴍʏ wᴀʟᴇs, ꜰᴏʀ ꜰᴀʀ ᴛᴏᴏ ʟᴏɴɢ ʜᴀsᴛ ᴛʜᴏᴜ ᴄᴏʀʀᴜᴘᴛᴇᴅ ᴛʜᴇ ᴡᴏʀʟᴅ ᴡɪᴛʜ ᴛʜɪɴᴇ wɪᴋɪᴍᴇᴅɪᴀ fᴏᴜɴᴅᴀᴛɪᴏɴ. fᴏʀ ꜰᴀʀ ᴛᴏᴏ ʟᴏɴɢ ʜᴀsᴛ ᴛʜᴏᴜ ɢɪᴠᴇɴ ʟᴀᴢʏ ʜɪsᴛᴏʀʏ sᴛᴜᴅᴇɴᴛs ᴀɴ ᴇᴀsʏ ᴡᴀʏ ᴛᴏ ᴄʜᴇᴀᴛ ɪɴ ᴛʜᴇɪʀ ᴏɴʟɪɴᴇ ᴄʟᴀssᴇs. fᴏʀ ꜰᴀʀ ᴛᴏᴏ ʟᴏɴɢ ʜᴀsᴛ ᴛʜᴏᴜ ᴅᴇᴘʀɪᴠᴇᴅ ᴛʜᴇ ᴡᴏʀʟᴅ ᴏꜰ osᴄᴀʀ wɪʟᴅᴇ ǫᴜᴏᴛᴇs. fᴏʀ ꜰᴀʀ ᴛᴏᴏ ʟᴏɴɢ ʜᴀsᴛ ᴛʜᴏᴜ ᴅʀɪᴠᴇɴ ɢᴏᴅʟʏ ᴡɪᴋɪ ᴇᴅɪᴛᴏʀs ᴛᴏ cᴏɴsᴇʀᴠᴀᴘᴇᴅɪᴀ. nᴏᴡ, ᴛʜɪɴᴇ ᴛɪᴍᴇ ʜᴀsᴛ ᴄᴏᴍᴇ!\nwith that, jack raises the scythe and brings it down upon jimbo. for a second, jack expects his powers to blaze forth in resistance, but fate is with the reaper. with a cry of \u0026ldquo;ooolllhhh,\u0026rdquo; jimbo turns bright red and collapses on his side, only to explode into a few particles of white smoke. yet, green orbs containing his essence appear ex nihilo and are absorbed into jack. he realizes the secrets of life, the universe and everything. he himself becomes a god.\njack and the reaper go their separate ways but remain close friends, and sometimes meet for subs at jersey mike\u0026rsquo;s.\nusing his divine powers, jack conquers the world. seas rise when he gives the word. he shall never have to put up with the sound of roman calvary choirs singing nor of jerusalem bells ringing, for he is not merely any emperor. he is the god emperor of mankind.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Intermission One: The Clash of the Gods"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/11/","summary":"The woman accepts Jimmy Wales into her heart as her Lord and Savior and walks away. Suddenly, Jack gets a text on his phone from Jimmy Wales.\n\u0026ldquo;You are doing well, son, you have proved yourself to me. Your Wikipedia article shall be stared and featured in rewards for your service.\n\u0026ldquo;But, I have a mission for you. Accept, and I shall give you glory beyond your wildest dreams. Reject, and my wrath shall abide upon thee.","tags":["Humor","Math Problems","Math Problems Season 2"],"text":"the woman accepts jimmy wales into her heart as her lord and savior and walks away. suddenly, jack gets a text on his phone from jimmy wales.\n\u0026ldquo;you are doing well, son, you have proved yourself to me. your wikipedia article shall be stared and featured in rewards for your service.\n\u0026ldquo;but, i have a mission for you. accept, and i shall give you glory beyond your wildest dreams. reject, and my wrath shall abide upon thee.\u0026rdquo;\njack thinks for a second, and eventually responds : \u0026ldquo;ay jimmy bro, wikipedia kinda sux ngl fam lamo. ive just found this thing called uncyclopedia thats just like ur website but more better. those fellas got oscar wilde quotes all over the place and you dont bro idk what 2 tell u\u0026rdquo;\nfor a second, it seems nothing has changed. but then, jimmy wales begins typing. \u0026ldquo;how dar\u0026rsquo;st thou speakest in such a vile manner? thou hast forsaken the one true and holy online encyclopedia project for some shitty comedy outfit. in but a moment, thou shalt know mine fury!\u0026rdquo;\njack begins to feel a pain in his chest \u0026amp; a sense of impending doom. he knows that jimmy wales must have cursed him for his impiety.\nthe grim reaper senses that jack is going to die, so he starts driving toward jack in his flying hearse. of all the souls in the world who need to be harvested, jack is top priority because he cheated death recently.\nif jack is in mazatlán, mexico, and the grim reaper is in elbasan, albania. the distance between mazatlán and elbasan is 6,826 miles. if the grim reaper’s flying hearse travels 2,145 miles an hour, how many milliseconds will it be before he reaches mazatlán?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Eleven: The End of the Road"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/10/","summary":"Jack meets a half - naked woman from the University of California Santa Barbra, premiere party school of the United States. Before Jack even opens his mouth, she offers to have sex with him. Jack wants to very badly, but he knows he must remain chaste for Jimmy Wales.\n\u0026ldquo;Why do you let dirty men lust over you day after day?\u0026rdquo; Jack begins. \u0026ldquo;Darling, it doesn\u0026rsquo;t have to be like this.","tags":["Humor","Math Problems","Math Problems Season 2"],"text":"jack meets a half - naked woman from the university of california santa barbra, premiere party school of the united states. before jack even opens his mouth, she offers to have sex with him. jack wants to very badly, but he knows he must remain chaste for jimmy wales.\n\u0026ldquo;why do you let dirty men lust over you day after day?\u0026rdquo; jack begins. \u0026ldquo;darling, it doesn\u0026rsquo;t have to be like this. have you ever used wikipedia, my darling? this website i use on the daily. wikipedia is the greatest website you have ever been on, it is the very meaning for life for me. jimmy wales made wikipedia, ransoming us from an eternity of having to pay for library cards! this is a great gift, but there\u0026rsquo;s a catch. jimmy wales demands celibacy from us, because sexual intercourse distracts us from editing wikipedia, and we can\u0026rsquo;t have that.\u0026rdquo;\nthe promiscuous californian breaks down and cries. \u0026ldquo;how can i have transgressed so gravely against jimmy wales? when i went to santa barbra, i was eighteen years old, and then my partying began! now i\u0026rsquo;m 34, and i\u0026rsquo;m still there, partying as hard as i was the first day! if i spent 8 hours having drunken sex with strangers every day from the minute i got to santa barbra, how many hours was i prevented from editing wikipedia? if i slept with twelve strangers every day and 3% of them had stds, how many stds do i have today? please, jimmy wales, have mercy on me!\u0026rdquo;\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Ten: Our Hero Leads a Wayward Fornicator to Faith in Jimmy Wales"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/9/","summary":"Jack travels through Chase\u0026rsquo;s tunnel for a long time, eventually escaping to Mazatlán, Mexico. But, when he exits the tunnel, he sees what he wants. He sees what he needs. He sees a drug dealer passing out heroin. The temptation is too strong for Jack. Impulsively, almost instinctively, Jack moves toward him and asks for drugs.\n\u0026ldquo;¡No hablo ingles!\u0026rdquo; responds the other man, quién es totalmente hispanoablante. So, if Jack wants his drugs, he must learn Spanish.","tags":["Humor","Math Problems","Math Problems Season 2"],"text":"jack travels through chase\u0026rsquo;s tunnel for a long time, eventually escaping to mazatlán, mexico. but, when he exits the tunnel, he sees what he wants. he sees what he needs. he sees a drug dealer passing out heroin. the temptation is too strong for jack. impulsively, almost instinctively, jack moves toward him and asks for drugs.\n\u0026ldquo;¡no hablo ingles!\u0026rdquo; responds the other man, quién es totalmente hispanoablante. so, if jack wants his drugs, he must learn spanish. to this end, he steals a spanish textbook from a nearby shop. if it takes him an average of thirteen hours to memorize a spanish word (jack has been near 5g towers recently and they have adversely impacted his brain), and he needs a thousand words to be conversational, how long will it take him to get there assuming he sleeps for 12 hours a night?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Problema de Matemáticas Nueve: Jack Aprende Español...Despacito"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/8/","summary":"Jack asks Chase if he can help him escape the Men in Black. Chase offers to let Jack escape down the secret tunnel he uses to traffic fursuits from Mazatlán, Mexico to Denver, Colorado.\nIf Denver is 1142 miles away from Mazatlán, and if Chase\u0026rsquo;s lover dug through five miles of dirt a week, how many days did it take for the tunnel to be completed? If Chase could also dig through five miles of dirt, how much faster could they have finished the tunnel if he had been doing that instead of playing Call of Duty?","tags":["Humor","Math Problems","Math Problems Season 2"],"text":"jack asks chase if he can help him escape the men in black. chase offers to let jack escape down the secret tunnel he uses to traffic fursuits from mazatlán, mexico to denver, colorado.\nif denver is 1142 miles away from mazatlán, and if chase\u0026rsquo;s lover dug through five miles of dirt a week, how many days did it take for the tunnel to be completed? if chase could also dig through five miles of dirt, how much faster could they have finished the tunnel if he had been doing that instead of playing call of duty?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem 8: Ah, for just one time, I would take the Secret Passage, to Find the Hand of Chaser Reading Down to Mexico"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/7/","summary":"Jack arrives at his buddy Chase\u0026rsquo;s house. He knocks on the door, and Chase welcomes Jack into his home. Chase and his lover feed Jack dinner, and Jack happens to look at a computer that is open to Chase\u0026rsquo;s Xbox account. Jack\u0026rsquo;s old pal has spent 134,275 Hours playing Call of Duty.\nIf it has been 20 years since Chase first picked up Call of Duty, what fraction of that time has he spent playing it?","tags":["Humor","Math Problems","Math Problems Season 2"],"text":"jack arrives at his buddy chase\u0026rsquo;s house. he knocks on the door, and chase welcomes jack into his home. chase and his lover feed jack dinner, and jack happens to look at a computer that is open to chase\u0026rsquo;s xbox account. jack\u0026rsquo;s old pal has spent 134,275 hours playing call of duty.\nif it has been 20 years since chase first picked up call of duty, what fraction of that time has he spent playing it?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Seven: The Chase and the Xbox"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/6/","summary":"Our hero escapes prison, at least for now.","tags":["Humor","Math Problems","Math Problems Season 2"],"text":"the grim reaper checked jack\u0026rsquo;s wikipedia page just after jimmy wales edited it. thus, he let jack escape his bloody scythe. the prison faculty still thought that he was dead, though, so they took him to the morgue. jack wakes up on the autopsy table five hours later and sees a lab aid with his back turned, apparently preparing to cut him open. jacks takes great offense at this, so he sneaks up on this sorry fellow and knocks him unconscious, robbing him of his car keys and fancy lab coat in the process. pretending to be the lab aid, jack sneaks into the parking garage and gets in his victim\u0026rsquo;s car.\nwhen the government hears about jack, they believe he is a paranormal phenomenon, so they send the men in black after him. it took 5 hours before the report reached the director of the men in black, and it takes a further 5 hours to prepare their black helicopter, which is 522 miles behind jack and can move at a 122 an hour. jack exited the crime lab 231 miles from his buddy chase\u0026rsquo;s house, and jack decides to seek refuge with him. jack stole a bad car and thus can only drive at a maximum of 75 miles an hour. will jack get to chase\u0026rsquo;s house before the men in black can get to him?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Six: Jack Hits the Road"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/5/","summary":"Our Hero attempts to fund Wikipedia","tags":["Humor","Math Problems","Math Problems Season 2"],"text":"jack knows what he has to do. he feels in his bones that jimmy wales is on his side. he knows, through a burning in his bosom, that jimmy wales will help him get revenge on his ex-wife. he\u0026rsquo;s just got to get this tyrone character to donate money to wikipedia. jack eventually finds tyrone and implores him to give jimbo money, reminding him of all the lazy college students \u0026amp; malnourished somali kids who rely on it for information. but, tyrone hardens his heart, refusing all of jack\u0026rsquo;s pleas.\njack knows he must get that money for wikipedia, but he sees no way to attain it without resorting to violence. so, he withdraws his shank and thrusts it toward the other man. but, jack is new to prison and not learned in the shank-arts. tryone lithely intercepts his blow and unholesters a shank of his own, which penetrates jack\u0026rsquo;s torso a moment later.\nour hero collapses to the ground, feeling the life ebbing away from him. but jimmy wales remembers his servant and decides to intervene by editing jack\u0026rsquo;s wikipedia article to say that he is not dead. the grim reaper will receive a notification on his phone that jack is supposed to die in 5 seconds. then, he will spend 8 minutes checking jack\u0026rsquo;s information on the internet to ensure that he is in fact dead.\nit will take jimmy wales 63 seconds to fabricate sources and then 32 seconds to edit jack\u0026rsquo;s wikipedia article. if the probability that the grim reaper has checked jacks wikipedia article begins at 4% and increases 5% every minute, how likely is it that the grim reaper will have checked it in 7 minutes? if the probability that the grim reaper will trust wikipedia and is 64%, how likely is it that the grim reaper will have checked jack\u0026rsquo;s wikipedia article 8 minutes after it has been edited and trust it?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Five: Enter the Grim Reaper"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/4/","summary":"Our hero receives a message","tags":["Humor","Math Problems","Math Problems Season 2"],"text":"jack hates it in prison. he has nothing to eat but stale peanut butter sandwiches and no one to talk but the guard outside his cell, who keeps going on about how people in some place jack\u0026rsquo;s never heard of have curved swords. jack can’t feel anything but a searing hatred for his ex-wife. it’s all because of her that he\u0026rsquo;s in here. she was the one who used reverse psychology to get him to use heroin and steal his mother’s wedding ring. she was the one who stole everything from he had in his divorce. she was the one who set him on the path to coming here. jack wants nothing but to find a way to get back at her.\njack sits down in the cafeteria to eat. he hopes someone will offer to trade him drugs, but no luck so far. a big guy walk over to jack and hands him a parcel. to jack\u0026rsquo;s dismay, the parcel only contains a note, a shank and a phone. the note reads:\nto whom it may concern,\nwe are the cult of wikipedia and its holy founder, jimmy wales. the scoffers may say that jimmy wales is a mortal man or that wikipedia is not accurate, but you know these are lies. soon, i promise, you will witness the power and glory of jimmy wales, but first you must prove your loyalty to him. jimmy wales is a jealous god and he will not accept a servant who is not willing to serve him with his all.\nyour task is simple. there’s a man named tyrone stevens here in adx florence. before he was arrested, tyrone promised to donate $20 to wikipedia every month. wikipedia’s budget could be covered if every reader donated ₵0.007 every year. how much more did he donate then he had to? he promised to show that much devotion to jimmy wales, and thought he didn’t have to because he’s in federal prison.\njimmy wales disagrees. find a way to make him pay this money, even if you have to pry his credit card from his cold, dead hands. the shank is to help you with your work, and the phone has jimmy\u0026rsquo;s number on it. you can ask for help if you need it.\nmay jimmy wales watch over you.\n-a friend.\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Four: Enter Jimbo"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/3/","summary":"Our hero gets what's coming to him.","tags":["Humor","Math Problems","Math Problems Season 1"],"text":"as it happens, one of the games jack pirated contained a single sprite ripped from a nintendo game. as soon as shigeru miyamoto was made aware of this vicious felony, he dispatched nintendo\u0026rsquo;s elite legal goons to deal with the young scoundrel. they quickly capture jack and have him hauled before a grand jury to stand trial for his crimes against god, nature, and humanity.\nfor every 17.75 people who torrented the game from jack\u0026rsquo;s website, he will be condemned to spend 48 years inside the adx florence supermax detention center. if 18,427 people torrented the game from jack\u0026rsquo;s site, how many years will he be sentenced to spend in adx florence? if the average lifespan of an american male is 74.5 years, how many lifetimes will jack be condemned to in adx florence?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Three: In the Criminal Justice System, Copyright Violations are Considered Especially Heinous"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/2/","summary":"Our hero commits the unforgivable sin.","tags":["Humor","Math Problems","Math Problems Season 1"],"text":"jack opens a site for pirating video games. after a game comes out, it takes jack five hours to crack the game and three hours to load the necessary ransomware onto it. if jack pirates five games a week and will get a thousand dollars from every piece of ransomeware someone downloads, how many dollars will he make an in one week if six people download games from his site every hour?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem Two: Piracy is not a Victimless Crime"},{"date":"2023-03-18","image":"","imageAlt":"","link":"//localhost:1313/humor/math/1/","summary":"We meet our hero.","tags":["Humor","Math Problems","Math Problems Season 1"],"text":"jack steals his mother\u0026rsquo;s wedding ring and auctions it on ebay to pay for his heroin addiction. every five minutes, the taking price goes up by 100 dollars. if this goes on for two and a half hours, how much money will jack get? if jack can buy a gram of heroin for 120 dollars, and he consumes five grams of heroin every day, how long will be be able to maintain his drug addiction?\n\u0026lt;== back to math problems home page \u0026lt;==\n","title":"Math Problem One: Humble Beginnings"},{"date":"0001-01-01","image":"","imageAlt":"","link":"//localhost:1313/humor/glass/phil/","summary":"In our quest to find out whether the glass was half empty or half full, we first asked the world\u0026rsquo;s great philosophers. Here are their responses.\nLeibniz says: This is the fullest of all possible glasses.\nSchopenhauer says: Everything sucks, including the glass.\nThales says: The glass is completely full because the air in the top half is also water.\nThe mereological nihilist says: There is no glass.\nThe ontological nihilist says: I couldn\u0026rsquo;t have said it better than the previous guy, except what I think doesn\u0026rsquo;t stop sounding crazy if I spend fifteen minutes explaining it.","tags":["Half Empty or Half Full?","Humor","Philosophy"],"text":"in our quest to find out whether the glass was half empty or half full, we first asked the world\u0026rsquo;s great philosophers. here are their responses.\nleibniz says: this is the fullest of all possible glasses.\nschopenhauer says: everything sucks, including the glass.\nthales says: the glass is completely full because the air in the top half is also water.\nthe mereological nihilist says: there is no glass.\nthe ontological nihilist says: i couldn\u0026rsquo;t have said it better than the previous guy, except what i think doesn\u0026rsquo;t stop sounding crazy if i spend fifteen minutes explaining it.\naristotle says: the glass is actually half empty but possesses the potentiality to be half full.\nanselm says: in using this vessel as part of thine shitty comedy operation, thou hast offended its unfathomably great honor. (sighs) looks like we\u0026rsquo;re gonna have to set you on fire, bud.\nthe logical positivist says: your question is not only extremely annoying but also utterly meaningless.\nmichael huemer says: it just seems really obvious that the glass is half full.\nthe panpsychist says: why don\u0026rsquo;t you just ask him, man?\nplato says: the glass halfway participates in the form of fullness.\njohn rawls says: the glass would agree to be half full.\nspinoza says: on god or nature, you brought me back to life just to ask me that?\nthe solipsist says: the glass doesn\u0026rsquo;t exist and neither do you. oh, you disagree with that? that\u0026rsquo;s just what a nonexistent person would say.\nlance bush says: the notion of a \u0026ldquo;full glass\u0026rdquo; is completely unintelligible.\nthe analytic philosopher says: okay, let\u0026rsquo;s unpack this a little \u0026hellip; [begins a seven hour monologue discussing the precise usage of the terms involved and their history, making heavy use of symbolic logic and bayes\u0026rsquo; theorem all the while. his conclusion: \u0026ldquo;i dunno bro, it\u0026rsquo;s probably just semantics or something.\u0026rdquo;]\nthe continental philosopher says: hark upon the serendipitous quintessence with which we must congitate upon such a query - multitudinous intrepid spirits hath ruminated upon this antique problem passim the eons; for the portion of this individuated subjectivity, think he that the chalice mays perchance be halfway empty - if considered from a certain point of view, but that, in pure disreflective beingness - if perchance such a thing might there be - the query musts finally remain unanswered; or perhaps there is no that such to be gobbledegooked; perchance instead it be that gobbledebooking shall not maintain apace of the clandestine ruminations liken to \u0026hellip; [he continues on like this for the next fifteen minutes, liberally using many obscure words and several he just made up (as well as all punctuation marks save periods). one of our interns gets the best sleep of her life. towards the end he begins shouting in french, throws the glass out the window, and faints]\n","title":"Half Empty or Half Full? Philosophers respond."},{"date":"0001-01-01","image":"","imageAlt":"","link":"//localhost:1313/humor/glass/politics/","summary":"For good measure, we also reached out to several prominent politicians for their thoughts on the matter.\nKamala Harris says: It is in the Venn diagram of glasses which are half empty and glasses which are half full.\nDonald Trump says: Half of this glass was stolen by brutal MS - 13 gang members, allowed to invade across our Southern border by the radical left. It\u0026rsquo;s just horrible, horrible what they\u0026rsquo;re doing to our country.","tags":["Half Empty or Half Full?","Humor","Politics"],"text":"for good measure, we also reached out to several prominent politicians for their thoughts on the matter.\nkamala harris says: it is in the venn diagram of glasses which are half empty and glasses which are half full.\ndonald trump says: half of this glass was stolen by brutal ms - 13 gang members, allowed to invade across our southern border by the radical left. it\u0026rsquo;s just horrible, horrible what they\u0026rsquo;re doing to our country.\njoe biden says: what you saying, jack? \u0026hellip; \u0026ldquo;shabapaqoba?\u0026rdquo; \u0026hellip; come on, man.\nmarjorie taylor green says: da jooos!!! da jooos stole half of the glass!!! with their weather machines!!! it is written on the guidestones!!!\nbeto o\u0026rsquo;rourke says: [something obscene about cows. we daren\u0026rsquo;t repeat it here]\nkristie noem says: i shot the glass.\n","title":"Half Empty or Half Full? Politicans respond."},{"date":"0001-01-01","image":"","imageAlt":"","link":"//localhost:1313/humor/glass/religion/","summary":"We also asked people of all faiths and no faith \u0026ndash; God\u0026rsquo;s gotta have something to say about the great questions of life, right?\nThe agnostic says: I don\u0026rsquo;t know.\nThe strong agnostic says: You don\u0026rsquo;t know.\nThe gnostic says: I know, and it makes me feel important, so you don\u0026rsquo;t get to know.\nThe atheist says: \u0026hellip; [excuse us, we appear to have contacted a brick by mistake \u0026ndash; it lacks a belief in God]","tags":["Half Empty or Half Full?","Humor","Religion"],"text":"we also asked people of all faiths and no faith \u0026ndash; god\u0026rsquo;s gotta have something to say about the great questions of life, right?\nthe agnostic says: i don\u0026rsquo;t know.\nthe strong agnostic says: you don\u0026rsquo;t know.\nthe gnostic says: i know, and it makes me feel important, so you don\u0026rsquo;t get to know.\nthe atheist says: \u0026hellip; [excuse us, we appear to have contacted a brick by mistake \u0026ndash; it lacks a belief in god]\nthe catholic says: i know that her accidents are those a glass, but in essence this object is obviously natalie portman. damn \u0026hellip; she\u0026rsquo;s so hot \u0026hellip; [looks at glass, eyes glaze over, and begins to drool]\nthe high - church anglican says: omg sister, you are so right!!! slay queen!!! [looks at catholic, eyes glaze over, and begins to drool]\nthe low - church anglican says: nah girlies, that\u0026rsquo;s too far. like, the glass is def natalie portman, but she\u0026rsquo;s just there in spirit or something.\nthe jew says: huh? why do you people think the glass is natalie portman?\nthe southern baptist says: she isn\u0026rsquo;t!!! they\u0026rsquo;re wrong!!! it just commemorates her!!! or something!!!\nthe quaker says: oh, it might be natalie portman, it might not, i don\u0026rsquo;t really care.\nan unnamed presbyterian says: what\u0026rsquo;s wrong with you people?! you stand there, claiming that this is but a glass, but you know in your heart that it is natalie portman. everybody out there, despite their claims to the contrary, knows perfectly well that this glass is natalie portman. [stands back, inclining his head slightly, admiring his unmatched powers to read minds.]\n","title":"Half Empty or Half Full? Religious people respond."}]
}

